{
  "<PAD>": 0,
  "<EOS>": 1,
  "-5[8:1]": 2,
  "-4[8:1]": 3,
  "-1[8:1]": 4,
  "-8[8:1]": 5,
  "-3[8:1]": 6,
  "-6[8:1]": 7,
  "-2[8:1]": 8,
  "-7[8:1]": 9,
  "<5[8:1]": 10,
  ">4[8:1]": 11,
  "<6[8:1]": 12,
  ">3[8:1]": 13,
  "<4[8:1]": 14,
  ">5[8:1]": 15,
  "-5[4:3]": 16,
  "-4[4:3]": 17,
  ">2[8:1]": 18,
  "-5[4:1]": 19,
  "-4[4:1]": 20,
  ">1[8:1]": 21,
  "<7[8:1]": 22,
  "<8[8:1]": 23,
  "<1[8:1]": 24,
  ">8[8:1]": 25,
  ">5[4:1]": 26,
  "-5[2:1]": 27,
  "-4[2:1]": 28,
  "<4[4:1]": 29,
  "<5[4:1]": 30,
  "-8[4:1]": 31,
  "-1[4:1]": 32,
  ">4[4:1]": 33,
  "<6[4:1]": 34,
  ">3[4:1]": 35,
  "-3[4:1]": 36,
  "-6[4:1]": 37,
  ">1[4:1]": 38,
  "<8[4:1]": 39,
  "<1[4:1]": 40,
  "<7[4:1]": 41,
  ">8[4:1]": 42,
  ">2[4:1]": 43,
  "v4[8:1]": 44,
  "-3[4:3]": 45,
  "-6[4:3]": 46,
  "-1[2:1]": 47,
  "-8[2:1]": 48,
  "-6[2:1]": 49,
  "-2[4:1]": 50,
  "-3[2:1]": 51,
  "v5[8:1]": 52,
  "-8[4:3]": 53,
  "-1[4:3]": 54,
  "<4[2:1]": 55,
  "-7[4:1]": 56,
  ">5[2:1]": 57,
  "-4[8:3]": 58,
  "-5[8:3]": 59,
  "-5[16:1]": 60,
  ">6[4:1]": 61,
  "w5[8:1]": 62,
  "<3[4:1]": 63,
  "-4[16:1]": 64,
  "v1[8:1]": 65,
  "v3[8:1]": 66,
  "p3[8:1]": 67,
  "<1[2:1]": 68,
  "q6[8:1]": 69,
  ">6[2:1]": 70,
  "w4[8:1]": 71,
  ">8[2:1]": 72,
  "<3[2:1]": 73,
  "-1[8:3]": 74,
  "-8[8:3]": 75,
  "<5[2:1]": 76,
  "v8[8:1]": 77,
  ">4[2:1]": 78,
  "<8[2:1]": 79,
  "*-6[8:1]": 80,
  ">1[2:1]": 81,
  "q5[8:1]": 82,
  "<2[4:1]": 83,
  "p4[8:1]": 84,
  "<4[8:3]": 85,
  ">5[8:3]": 86,
  "-2[2:1]": 87,
  "-3[16:1]": 88,
  "<6[2:1]": 89,
  ">7[4:1]": 90,
  "*-7[8:1]": 91,
  "-6[16:1]": 92,
  "-6[8:3]": 93,
  "-3[8:3]": 94,
  "-7[2:1]": 95,
  "*-8[8:1]": 96,
  "v6[8:1]": 97,
  "-1[16:1]": 98,
  "q8[8:1]": 99,
  "pp4[2:1]": 100,
  ">3[2:1]": 101,
  "-8[16:1]": 102,
  "q5[4:1]": 103,
  "p1[8:1]": 104,
  "p5[8:1]": 105,
  "p4[4:1]": 106,
  "v2[8:1]": 107,
  "*-5[8:1]": 108,
  "q4[8:1]": 109,
  ">6[8:3]": 110,
  "w1[8:1]": 111,
  "p3[4:1]": 112,
  ">8[8:3]": 113,
  "<5[8:3]": 114,
  "<2[2:1]": 115,
  ">4[8:3]": 116,
  "w8[8:1]": 117,
  "q2[8:1]": 118,
  "<8[8:3]": 119,
  "<3[8:3]": 120,
  "p7[8:1]": 121,
  "qq5[2:1]": 122,
  ">7[2:1]": 123,
  ">1[8:3]": 124,
  "p4[2:1]": 125,
  "q6[4:1]": 126,
  "q5[2:1]": 127,
  ">2[2:1]": 128,
  "<7[2:1]": 129,
  "<1[8:3]": 130,
  "*>4[8:1]": 131,
  "v7[8:1]": 132,
  "pp4[8:3]": 133,
  "-5[16:3]": 134,
  "v4[4:1]": 135,
  "-7[4:3]": 136,
  "q1[8:1]": 137,
  ">5[4:3]": 138,
  "-4[16:3]": 139,
  "pp4[4:1]": 140,
  "-2[16:1]": 141,
  "-7[16:1]": 142,
  "pp5[2:1]": 143,
  "<4[4:3]": 144,
  "V51[4:1]": 145,
  "<6[8:3]": 146,
  ">7[8:3]": 147,
  "q3[8:1]": 148,
  "p8[8:1]": 149,
  "-2[8:3]": 150,
  "-2[4:3]": 151,
  "p6[8:1]": 152,
  "-7[8:3]": 153,
  "<2[8:3]": 154,
  ">3[8:3]": 155,
  "-5[4:5]": 156,
  "-4[4:5]": 157,
  "pp4[4:5]": 158,
  "-4[12:1]": 159,
  "qq5[8:3]": 160,
  "V48[4:1]": 161,
  "p1[4:1]": 162,
  "p3[2:1]": 163,
  "q3[4:1]": 164,
  "p6[4:1]": 165,
  "p5[4:1]": 166,
  "pp8[2:1]": 167,
  "q6[2:1]": 168,
  ">6[4:3]": 169,
  "<3[4:3]": 170,
  "pp4[4:3]": 171,
  "s5[4:1]": 172,
  "*>3[8:1]": 173,
  "<5[4:3]": 174,
  "qq5[4:5]": 175,
  "q1[4:1]": 176,
  "q8[4:1]": 177,
  "v5[4:1]": 178,
  "q4[4:1]": 179,
  "-5[12:1]": 180,
  ">4[4:3]": 181,
  "p2[8:1]": 182,
  "p8[4:1]": 183,
  "*-4[8:1]": 184,
  "pp5[4:1]": 185,
  "qq1[2:1]": 186,
  ">8[4:3]": 187,
  "s5[2:1]": 188,
  "qq4[2:1]": 189,
  ">2[8:3]": 190,
  "V64[4:1]": 191,
  "qq5[4:3]": 192,
  "p3[8:3]": 193,
  "qq5[4:1]": 194,
  "p2[4:1]": 195,
  "q7[4:1]": 196,
  "q2[4:1]": 197,
  "pp1[2:1]": 198,
  "p4[8:3]": 199,
  "p7[4:1]": 200,
  "V35[4:1]": 201,
  "pp5[8:3]": 202,
  "q6[8:3]": 203,
  "q7[8:1]": 204,
  "q5[8:3]": 205,
  "-8[12:1]": 206,
  "-5[32:3]": 207,
  "qq8[2:1]": 208,
  ">1[4:3]": 209,
  "-4[32:3]": 210,
  ">4[16:3]": 211,
  "<5[16:3]": 212,
  "<8[4:3]": 213,
  "<1[4:3]": 214,
  "pp8[4:5]": 215,
  "-6[16:3]": 216,
  "p5[2:1]": 217,
  "-4[1:1]": 218,
  "<7[8:3]": 219,
  "v1[4:1]": 220,
  "p4[4:5]": 221,
  "<4[16:3]": 222,
  "z4[4:1]": 223,
  "q5[4:5]": 224,
  "pp1[4:1]": 225,
  "-3[16:3]": 226,
  "-1[12:1]": 227,
  "qq8[4:1]": 228,
  "q4[2:1]": 229,
  "-8[16:3]": 230,
  "qq1[4:5]": 231,
  "-1[16:3]": 232,
  "v6[4:1]": 233,
  "v3[4:1]": 234,
  ">5[16:3]": 235,
  "-5[1:1]": 236,
  "<4[8:5]": 237,
  "-6[12:1]": 238,
  "pp3[2:1]": 239,
  "qq6[2:1]": 240,
  ">5[8:5]": 241,
  "V46[4:1]": 242,
  "q3[2:1]": 243,
  "<3[4:5]": 244,
  "v8[4:1]": 245,
  "pp3[8:1]": 246,
  "<5[16:1]": 247,
  "qq4[4:1]": 248,
  "z4[2:1]": 249,
  "s5[8:3]": 250,
  "qq4[8:3]": 251,
  ">6[4:5]": 252,
  ">7[4:3]": 253,
  "*v6[8:1]": 254,
  "<6[16:1]": 255,
  ">4[16:1]": 256,
  "V84[4:1]": 257,
  "<6[4:3]": 258,
  "<2[4:3]": 259,
  "V15[4:1]": 260,
  "V71[4:1]": 261,
  "V28[4:1]": 262,
  "w5[4:1]": 263,
  "-3[12:1]": 264,
  ">6[8:1]": 265,
  "V53[4:1]": 266,
  "pp1[8:3]": 267,
  "<6[16:3]": 268,
  "w4[4:1]": 269,
  ">5[4:5]": 270,
  "-1[8:5]": 271,
  "qq3[2:1]": 272,
  "p4[4:3]": 273,
  "pp8[8:3]": 274,
  "*<7[8:1]": 275,
  "-8[4:5]": 276,
  ">6[1:1]": 277,
  ">6[8:5]": 278,
  "qq8[8:3]": 279,
  ">3[4:3]": 280,
  "pp4[8:5]": 281,
  "q5[4:3]": 282,
  "-1[32:3]": 283,
  "pp6[2:1]": 284,
  "-6[4:5]": 285,
  "p6[2:1]": 286,
  "*<8[8:1]": 287,
  "p8[2:1]": 288,
  "p2[2:1]": 289,
  "V82[4:1]": 290,
  ">3[16:3]": 291,
  "<4[4:5]": 292,
  "<3[8:1]": 293,
  "-1[4:5]": 294,
  "-8[32:3]": 295,
  "qq1[8:3]": 296,
  "-3[4:5]": 297,
  "w1[4:1]": 298,
  "-2[16:3]": 299,
  "s5[8:1]": 300,
  "pp5[4:3]": 301,
  "pp2[8:3]": 302,
  "v2[4:1]": 303,
  "V31[4:1]": 304,
  "<3[8:5]": 305,
  "qq1[4:3]": 306,
  "-5[8:5]": 307,
  "q1[2:1]": 308,
  "<8[16:3]": 309,
  "w8[4:1]": 310,
  ">3[16:1]": 311,
  "-8[8:5]": 312,
  "<1[16:3]": 313,
  "pp8[4:3]": 314,
  "*v5[8:1]": 315,
  ">8[4:5]": 316,
  "-8[1:1]": 317,
  "-4[8:5]": 318,
  "<3[1:1]": 319,
  "pp7[2:1]": 320,
  "<7[16:3]": 321,
  "pp4[1:1]": 322,
  "pp6[4:1]": 323,
  "-5[4:7]": 324,
  "<1[4:5]": 325,
  "v5[2:1]": 326,
  "*-3[8:1]": 327,
  ">1[16:3]": 328,
  ">2[16:3]": 329,
  "-2[12:1]": 330,
  "V17[4:1]": 331,
  "<1[8:5]": 332,
  "qq5[8:5]": 333,
  "qq7[8:3]": 334,
  "<5[8:5]": 335,
  "pp6[8:3]": 336,
  "<2[4:5]": 337,
  ">8[8:5]": 338,
  "qq1[4:1]": 339,
  "-3[8:5]": 340,
  "p5[8:3]": 341,
  ">5[1:1]": 342,
  "q4[8:3]": 343,
  ">5[16:1]": 344,
  "pp4[8:1]": 345,
  "-3[32:3]": 346,
  "qq7[2:1]": 347,
  ">8[1:1]": 348,
  "<4[1:1]": 349,
  "pp7[4:1]": 350,
  "-4[4:7]": 351,
  "-6[8:5]": 352,
  ">4[8:5]": 353,
  "<1[1:1]": 354,
  ">8[2:3]": 355,
  "v4[2:1]": 356,
  "-7[12:1]": 357,
  "-6[32:3]": 358,
  "qq5[8:1]": 359,
  "pp3[4:1]": 360,
  "qq6[4:1]": 361,
  "qq4[4:3]": 362,
  ">7[8:1]": 363,
  "p4[8:5]": 364,
  "q7[2:1]": 365,
  "<4[16:1]": 366,
  ">8[16:3]": 367,
  "qq6[8:1]": 368,
  "q2[2:1]": 369,
  "<2[8:1]": 370,
  "V75[4:1]": 371,
  "qq4[4:5]": 372,
  "V37[4:1]": 373,
  "V68[4:1]": 374,
  "qq2[2:1]": 375,
  "z4[8:3]": 376,
  "pp7[8:1]": 377,
  "-7[16:3]": 378,
  "*qq4[4:1]": 379,
  "-6[1:1]": 380,
  "pp2[2:1]": 381,
  "v7[4:1]": 382,
  "-2[8:5]": 383,
  "<2[8:5]": 384,
  "pp8[4:1]": 385,
  "-1[1:1]": 386,
  "qq2[4:1]": 387,
  "<5[12:1]": 388,
  "qq3[4:1]": 389,
  "q5[8:5]": 390,
  ">6[16:5]": 391,
  "qq6[8:3]": 392,
  "V35[8:1]": 393,
  ">4[12:1]": 394,
  "*v8[8:1]": 395,
  "qq5[1:1]": 396,
  "pp6[8:1]": 397,
  "qq2[8:1]": 398,
  "qq8[4:3]": 399,
  "s1[4:1]": 400,
  "pp2[4:1]": 401,
  "q3[8:3]": 402,
  "v5[8:3]": 403,
  "-7[8:5]": 404,
  ">7[4:5]": 405,
  "pp5[4:5]": 406,
  "-2[1:1]": 407,
  "p2[8:3]": 408,
  "<8[16:1]": 409,
  "p6[8:3]": 410,
  "<7[4:3]": 411,
  "*-2[8:1]": 412,
  "qq3[8:3]": 413,
  "V62[4:1]": 414,
  "*qq5[2:1]": 415,
  "w6[8:1]": 416,
  ">2[16:1]": 417,
  "V64[8:1]": 418,
  "v4[8:3]": 419,
  "s5[4:3]": 420,
  "s3[4:1]": 421,
  "V58[4:1]": 422,
  "pp1[4:3]": 423,
  ">4[1:1]": 424,
  "<7[16:1]": 425,
  "*<6[8:1]": 426,
  "-5[2:3]": 427,
  "p7[2:1]": 428,
  "p1[2:1]": 429,
  "<3[16:5]": 430,
  "pp5[8:5]": 431,
  "-3[1:1]": 432,
  "p5[4:3]": 433,
  ">4[4:5]": 434,
  "qq1[8:5]": 435,
  "pp8[8:5]": 436,
  "z4[4:3]": 437,
  "<5[1:1]": 438,
  "pp3[8:3]": 439,
  "<4[2:3]": 440,
  "-4[16:5]": 441,
  "z6[4:1]": 442,
  "V48[2:1]": 443,
  "V24[4:1]": 444,
  ">2[4:3]": 445,
  ">1[16:1]": 446,
  "z4[8:1]": 447,
  ">5[2:3]": 448,
  "V41[4:1]": 449,
  "*>2[8:1]": 450,
  "V51[8:3]": 451,
  "w5[2:1]": 452,
  "qq4[8:5]": 453,
  "p8[8:3]": 454,
  "*q5[8:1]": 455,
  "-4[2:3]": 456,
  "v8[2:1]": 457,
  "V51[2:1]": 458,
  "V84[2:1]": 459,
  "qq7[4:1]": 460,
  "<1[2:3]": 461,
  "V38[4:1]": 462,
  ">3[12:1]": 463,
  "-2[32:3]": 464,
  "-5[16:5]": 465,
  "V58[2:1]": 466,
  "p1[8:3]": 467,
  "*qq5[4:1]": 468,
  "v1[2:1]": 469,
  "-5[8:7]": 470,
  "*v7[8:1]": 471,
  "<5[4:5]": 472,
  "q1[8:3]": 473,
  "w1[2:1]": 474,
  "V41[2:1]": 475,
  "q8[2:1]": 476,
  "-5[0.1667##0.0833]": 477,
  "qq3[8:1]": 478,
  "pp1[4:5]": 479,
  "V46[8:1]": 480,
  ">7[2:3]": 481,
  ">8[4:7]": 482,
  ">1[12:1]": 483,
  "-4[0.1667##0.0833]": 484,
  "s1[2:1]": 485,
  "*>4[4:1]": 486,
  "q7[8:3]": 487,
  "V53[2:1]": 488,
  "pp1[8:5]": 489,
  ">7[8:5]": 490,
  "-7[32:3]": 491,
  "V57[4:1]": 492,
  ">5[16:5]": 493,
  "w7[8:1]": 494,
  "pp4[2:3]": 495,
  "*v4[8:1]": 496,
  "-7[1:1]": 497,
  "V53[8:1]": 498,
  "q8[8:3]": 499,
  "q6[4:3]": 500,
  "V48[8:3]": 501,
  "-1[16:5]": 502,
  "w8[2:1]": 503,
  "<2[16:5]": 504,
  ">3[8:5]": 505,
  "<8[4:5]": 506,
  "w4[2:1]": 507,
  "w3[8:1]": 508,
  "z8[2:1]": 509,
  "<3[2:3]": 510,
  "V64[2:1]": 511,
  "<6[8:5]": 512,
  "V61[4:1]": 513,
  "<5[16:5]": 514,
  "pp3[8:5]": 515,
  "-5[6:1]": 516,
  "qq7[8:1]": 517,
  "*>5[8:1]": 518,
  ">7[16:5]": 519,
  "V73[4:1]": 520,
  "V26[4:1]": 521,
  ">7[16:3]": 522,
  "V86[4:1]": 523,
  "-2[4:5]": 524,
  "pp6[4:3]": 525,
  "<8[8:5]": 526,
  ">1[8:5]": 527,
  "*qq4[2:1]": 528,
  "V74[4:1]": 529,
  "-4[8:7]": 530,
  "-4[6:1]": 531,
  "v6[2:1]": 532,
  ">1[4:5]": 533,
  "v3[2:1]": 534,
  "<4[16:5]": 535,
  "V46[2:1]": 536,
  "s1[8:3]": 537,
  "<3[16:3]": 538,
  "qq1[8:1]": 539,
  "<6[12:1]": 540,
  "V35[2:1]": 541,
  "z8[4:1]": 542,
  "pp6[4:5]": 543,
  "<7[12:1]": 544,
  "V75[8:1]": 545,
  "w5[8:3]": 546,
  "q4[4:3]": 547,
  "<2[2:3]": 548,
  "p3[4:3]": 549,
  "<2[1:1]": 550,
  "z2[4:1]": 551,
  "-8[16:5]": 552,
  "<8[12:1]": 553,
  ">2[12:1]": 554,
  "qq4[1:1]": 555,
  "qq3[4:3]": 556,
  ">6[16:3]": 557,
  "V25[4:1]": 558,
  "v3[8:3]": 559,
  "*qq5[8:3]": 560,
  "V82[8:1]": 561,
  ">5[12:1]": 562,
  "qq2[8:3]": 563,
  "pp4[16:5]": 564,
  "qq5[2:3]": 565,
  ">5[4:7]": 566,
  "s7[4:1]": 567,
  "pp4[4:7]": 568,
  "p8[4:3]": 569,
  "z6[2:1]": 570,
  "-6[16:5]": 571,
  "<1[16:1]": 572,
  ">3[4:5]": 573,
  "p7[8:3]": 574,
  "-7[4:5]": 575,
  "*-5[4:1]": 576,
  "qq8[8:5]": 577,
  ">4[16:5]": 578,
  "pp8[1:1]": 579,
  "-6[2:3]": 580,
  "V14[4:1]": 581,
  ">7[1:1]": 582,
  "-1[4:7]": 583,
  "s5[16:3]": 584,
  "qq6[8:5]": 585,
  "*<5[8:1]": 586,
  "qq5[4:7]": 587,
  "<1[4:7]": 588,
  "*v3[8:1]": 589,
  "q1[4:3]": 590,
  "q5[16:5]": 591,
  "-8[4:7]": 592,
  "s3[2:1]": 593,
  "pp5[1:1]": 594,
  ">4[32:3]": 595,
  "V15[2:1]": 596,
  ">8[16:1]": 597,
  "-2[2:3]": 598,
  "pp2[8:5]": 599,
  "w8[8:3]": 600,
  "*qq4[8:3]": 601,
  ">6[2:3]": 602,
  "qq7[4:3]": 603,
  "<2[16:3]": 604,
  "pp5[16:5]": 605,
  "-1[6:1]": 606,
  "V47[4:1]": 607,
  "V52[4:1]": 608,
  "*<8[4:1]": 609,
  "w1[8:3]": 610,
  "pp2[8:1]": 611,
  "qq8[4:5]": 612,
  "qq5[16:5]": 613,
  "s5[4:5]": 614,
  "V48[16:3]": 615,
  "V51[16:3]": 616,
  "<8[1:1]": 617,
  "-1[2:3]": 618,
  "pp8[8:1]": 619,
  "v8[8:3]": 620,
  "qq5[8:9]": 621,
  "V41[8:3]": 622,
  "pp7[8:3]": 623,
  "<5[6:1]": 624,
  "pp5[8:1]": 625,
  "q2[8:3]": 626,
  "w5[16:1]": 627,
  ">1[1:1]": 628,
  "V15[16:3]": 629,
  "v1[16:3]": 630,
  "V42[4:1]": 631,
  "p4[1:1]": 632,
  "v1[8:3]": 633,
  "*q4[8:1]": 634,
  "w2[8:1]": 635,
  "-3[8:7]": 636,
  "v2[2:1]": 637,
  "<7[4:5]": 638,
  "w4[8:3]": 639,
  "pp6[8:5]": 640,
  "V13[4:1]": 641,
  "<6[1:1]": 642,
  "qq3[4:5]": 643,
  "q5[1:1]": 644,
  "-8[6:1]": 645,
  "z3[4:1]": 646,
  "qq3[8:5]": 647,
  "V58[8:3]": 648,
  "<4[12:1]": 649,
  "V63[4:1]": 650,
  "-3[16:5]": 651,
  "qq1[1:1]": 652,
  "v6[8:3]": 653,
  "*>1[8:1]": 654,
  ">3[1:1]": 655,
  "<6[4:5]": 656,
  "q4[8:5]": 657,
  "*>3[4:1]": 658,
  "qq2[4:3]": 659,
  "pp7[4:3]": 660,
  "<4[6:1]": 661,
  ">4[6:1]": 662,
  "*-8[4:1]": 663,
  "p4[16:5]": 664,
  "<6[6:1]": 665,
  "*z4[8:1]": 666,
  "-7[2:3]": 667,
  "-6[8:7]": 668,
  "-1[8:7]": 669,
  "s5[8:5]": 670,
  "-2[16:5]": 671,
  ">1[16:5]": 672,
  ">4[2:3]": 673,
  "z6[8:3]": 674,
  "s3[8:3]": 675,
  "<5[32:3]": 676,
  "q4[4:5]": 677,
  "<4[4:7]": 678,
  "-6[4:7]": 679,
  "*qq2[8:1]": 680,
  "-3[4:7]": 681,
  "V84[16:3]": 682,
  "z8[8:1]": 683,
  "p3[8:5]": 684,
  "*-7[4:1]": 685,
  ">2[8:5]": 686,
  "V85[4:1]": 687,
  "<8[32:3]": 688,
  "V51[8:1]": 689,
  "V15[8:3]": 690,
  "z8[8:3]": 691,
  "pp3[4:3]": 692,
  "q3[4:3]": 693,
  "pp2[4:3]": 694,
  ">5[4:11]": 695,
  "V84[8:3]": 696,
  "*q3[4:1]": 697,
  ">2[6:1]": 698,
  "v4[4:3]": 699,
  "v5[4:3]": 700,
  "*v1[8:1]": 701,
  "V17[8:1]": 702,
  "s1[4:3]": 703,
  "pp8[2:3]": 704,
  "<1[4:11]": 705,
  "p2[4:3]": 706,
  "qq6[4:3]": 707,
  "s5[1:1]": 708,
  ">1[32:3]": 709,
  "V48[8:1]": 710,
  ">6[8:7]": 711,
  "p6[4:3]": 712,
  "*-6[4:1]": 713,
  "p4[16:3]": 714,
  "v7[2:1]": 715,
  "<8[16:5]": 716,
  "v4[16:1]": 717,
  "v3[16:1]": 718,
  "v5[16:1]": 719,
  ">3[2:3]": 720,
  "V15[8:1]": 721,
  ">8[8:7]": 722,
  "<6[32:3]": 723,
  "p6[16:3]": 724,
  ">2[4:5]": 725,
  "-3[2:3]": 726,
  "p5[4:5]": 727,
  "*p6[4:1]": 728,
  ">8[4:11]": 729,
  ">3[16:5]": 730,
  ">8[16:5]": 731,
  ">5[6:1]": 732,
  "V71[8:1]": 733,
  "-7[8:7]": 734,
  "<5[2:3]": 735,
  "*q1[8:1]": 736,
  "pp4[8:7]": 737,
  "V84[8:1]": 738,
  "pp3[4:5]": 739,
  "v8[16:3]": 740,
  "w4[16:1]": 741,
  "qq1[2:3]": 742,
  "V36[4:1]": 743,
  "-8[8:7]": 744,
  "pp4[8:9]": 745,
  "<6[16:5]": 746,
  "p3[16:3]": 747,
  "*qq4[4:3]": 748,
  "q5[16:3]": 749,
  "pp7[8:5]": 750,
  "v2[8:3]": 751,
  "s7[2:1]": 752,
  "-2[8:7]": 753,
  "p1[4:3]": 754,
  "*<7[4:1]": 755,
  "<4[4:11]": 756,
  "q8[4:3]": 757,
  ">5[8:7]": 758,
  "<3[8:7]": 759,
  "q6[16:3]": 760,
  "-8[2:3]": 761,
  "q6[8:5]": 762,
  "z8[4:3]": 763,
  "V31[8:1]": 764,
  "V42[8:1]": 765,
  "qq4[8:1]": 766,
  "qq7[8:5]": 767,
  "s7[8:3]": 768,
  "V38[2:1]": 769,
  "<1[1:2]": 770,
  "<1[16:5]": 771,
  "q3[16:3]": 772,
  "-7[16:5]": 773,
  "<7[1:1]": 774,
  "<7[6:1]": 775,
  "v3[16:3]": 776,
  "p5[1:1]": 777,
  "V28[2:1]": 778,
  "q1[16:3]": 779,
  "V35[8:3]": 780,
  "q4[16:5]": 781,
  "V53[8:3]": 782,
  "pp8[8:7]": 783,
  "qq4[16:5]": 784,
  "V85[2:1]": 785,
  "-5[16:9]": 786,
  "z2[2:1]": 787,
  "pp8[8:9]": 788,
  "p5[8:5]": 789,
  "V52[2:1]": 790,
  "v4[16:3]": 791,
  ">3[6:1]": 792,
  "*q5[4:1]": 793,
  "*q6[8:1]": 794,
  "V62[2:1]": 795,
  "*>5[4:1]": 796,
  "pp1[8:1]": 797,
  ">2[1:1]": 798,
  "*V14[4:1]": 799,
  "*p8[8:1]": 800,
  "z4[4:5]": 801,
  "*V35[8:1]": 802,
  "*qq1[2:1]": 803,
  "V17[2:1]": 804,
  "pp4[16:9]": 805,
  "V83[2:1]": 806,
  "<4[1:2]": 807,
  "z4[16:3]": 808,
  "<4[16:7]": 809,
  "qq1[8:7]": 810,
  "pp1[16:5]": 811,
  "v3[4:3]": 812,
  "V68[8:1]": 813,
  "<3[4:7]": 814,
  "w5[4:3]": 815,
  "<4[8:7]": 816,
  "p5[16:5]": 817,
  ">5[4:13]": 818,
  "pp8[4:7]": 819,
  "p8[16:3]": 820,
  "q4[1:1]": 821,
  "qq2[8:5]": 822,
  "z2[8:3]": 823,
  "qq1[4:7]": 824,
  "w8[4:3]": 825,
  "V16[2:1]": 826,
  "*V24[4:1]": 827,
  ">5[1:2]": 828,
  "q7[16:3]": 829,
  "p4[2:3]": 830,
  "p3[4:5]": 831,
  "-8[16:7]": 832,
  "-5[1:2]": 833,
  "V26[16:3]": 834,
  "<7[32:3]": 835,
  ">3[32:3]": 836,
  "qq8[1:1]": 837,
  ">4[8:7]": 838,
  "V47[2:1]": 839,
  "pp1[8:7]": 840,
  ">6[8:9]": 841,
  "v8[16:1]": 842,
  "*qq3[8:1]": 843,
  "*<1[8:1]": 844,
  "-3[6:1]": 845,
  "V71[2:1]": 846,
  "-6[6:1]": 847,
  "v5[16:3]": 848,
  "V83[4:1]": 849,
  "*qq8[2:1]": 850,
  "*qq7[8:1]": 851,
  "*p4[8:1]": 852,
  "v6[16:1]": 853,
  "V24[2:1]": 854,
  "V24[8:1]": 855,
  "q5[4:7]": 856,
  "V57[8:1]": 857,
  "q6[4:5]": 858,
  "*V68[4:1]": 859,
  "<2[8:7]": 860,
  "pp2[4:5]": 861,
  "w1[4:3]": 862,
  "<5[8:7]": 863,
  "V75[2:1]": 864,
  ">1[2:3]": 865,
  "V46[8:3]": 866,
  "<1[12:1]": 867,
  "z3[2:1]": 868,
  "qq8[8:7]": 869,
  "V13[2:1]": 870,
  "p2[16:3]": 871,
  "-1[8:9]": 872,
  "V28[8:1]": 873,
  "<1[6:1]": 874,
  "-5[0.3##0.15]": 875,
  "V37[2:1]": 876,
  "V72[4:1]": 877,
  "V72[16:3]": 878,
  "V74[8:1]": 879,
  "*q8[8:1]": 880,
  "pp2[1:1]": 881,
  "p1[8:5]": 882,
  "pp6[16:5]": 883,
  "p8[8:5]": 884,
  "<4[4:13]": 885,
  "V82[2:1]": 886,
  ">8[16:7]": 887,
  "V85[4:5]": 888,
  "qq8[16:5]": 889,
  "*<8[2:1]": 890,
  "*V35[4:1]": 891,
  "V16[4:1]": 892,
  "V85[8:3]": 893,
  "<4[8:9]": 894,
  "pp1[1:1]": 895,
  "<3[8:11]": 896,
  "pp6[1:1]": 897,
  "z4[1:1]": 898,
  "q5[2:3]": 899,
  "pp4[16:3]": 900,
  "q1[4:5]": 901,
  "V64[4:3]": 902,
  ">4[0.3##0.15]": 903,
  "*-8[2:1]": 904,
  "qq2[4:5]": 905,
  "V61[16:3]": 906,
  "pp4[16:7]": 907,
  "V14[8:3]": 908,
  "<1[8:7]": 909,
  "V31[2:1]": 910,
  ">6[8:11]": 911,
  "V14[4:5]": 912,
  "qq5[8:7]": 913,
  "<1[16:7]": 914,
  "p8[4:5]": 915,
  "*v2[8:1]": 916,
  "pp5[8:7]": 917,
  "qq4[8:7]": 918,
  "-4[16:9]": 919,
  "qq3[1:1]": 920,
  "pp3[1:1]": 921,
  "qq7[4:5]": 922,
  "pp8[16:5]": 923,
  "qq1[8:9]": 924,
  "V41[4:3]": 925,
  "V14[2:1]": 926,
  "<7[8:5]": 927,
  "qq6[4:5]": 928,
  "s4[4:1]": 929,
  "<6[8:7]": 930,
  "s5[16:5]": 931,
  ">8[6:1]": 932,
  "<8[6:1]": 933,
  ">1[6:1]": 934,
  "V58[4:3]": 935,
  "s1[8:1]": 936,
  "v5[24:1]": 937,
  "v1[16:1]": 938,
  "q7[4:3]": 939,
  "V86[2:1]": 940,
  "z5[4:1]": 941,
  "*s5[8:1]": 942,
  "<2[16:7]": 943,
  "qq4[2:3]": 944,
  "s3[4:5]": 945,
  "-5[8:9]": 946,
  "V13[8:1]": 947,
  "V25[2:1]": 948,
  "V64[8:3]": 949,
  "-7[16:9]": 950,
  "v2[4:3]": 951,
  "V27[4:1]": 952,
  "V51[1:1]": 953,
  "s5[8:7]": 954,
  ">8[4:13]": 955,
  ">7[16:7]": 956,
  "<8[2:3]": 957,
  ">5[4:9]": 958,
  ">5[16:9]": 959,
  "V15[4:3]": 960,
  "<4[16:9]": 961,
  ">2[32:3]": 962,
  "w4[12:1]": 963,
  "z3[8:3]": 964,
  "v7[16:1]": 965,
  "V58[8:1]": 966,
  "<7[16:5]": 967,
  "-4[0.3##0.15]": 968,
  "*v3[2:1]": 969,
  "*qq3[2:1]": 970,
  "-5[1.1538##0.1923]": 971,
  "*v6[2:1]": 972,
  "z6[4:3]": 973,
  "-3[16:7]": 974,
  "w8[16:3]": 975,
  "V46[4:3]": 976,
  ">1[4:7]": 977,
  "qq5[16:9]": 978,
  "V48[4:5]": 979,
  "V51[4:5]": 980,
  "z3[1:1]": 981,
  "s4[8:3]": 982,
  "-6[16:9]": 983,
  "-4[1:2]": 984,
  "*qq2[4:1]": 985,
  "qq7[1:1]": 986,
  "s1[8:5]": 987,
  ">7[4:7]": 988,
  "<5[4:7]": 989,
  ">4[4:7]": 990,
  "p5[16:3]": 991,
  "p6[4:5]": 992,
  ">8[12:1]": 993,
  "s6[4:1]": 994,
  ">8[16:9]": 995,
  "*V24[8:1]": 996,
  "s3[4:3]": 997,
  "V35[4:3]": 998,
  "-2[6:1]": 999,
  "qq6[1:1]": 1000,
  "p6[8:5]": 1001,
  "v4[24:1]": 1002,
  "*qq6[8:1]": 1003,
  "z4[8:5]": 1004,
  ">5[16:7]": 1005,
  ">1[16:7]": 1006,
  "V41[8:1]": 1007,
  "V35[16:3]": 1008,
  "V61[2:1]": 1009,
  "<7[2:3]": 1010,
  "z3[8:1]": 1011,
  "*-7[2:1]": 1012,
  "V62[16:3]": 1013,
  "z4[16:5]": 1014,
  ">6[16:7]": 1015,
  "*qq4[8:5]": 1016,
  "V74[2:1]": 1017,
  "q6[1:1]": 1018,
  "V68[2:1]": 1019,
  "*q5[8:3]": 1020,
  "V51[4:3]": 1021,
  "p4[4:7]": 1022,
  "<4[8:13]": 1023,
  "-4[8:9]": 1024,
  "w4[4:3]": 1025,
  "V51[16:5]": 1026,
  "*<7[2:1]": 1027,
  "qq3[2:3]": 1028,
  "-3[16:9]": 1029,
  "*v6[4:1]": 1030,
  "pp4[4:11]": 1031,
  "*qq3[4:1]": 1032,
  "V38[8:3]": 1033,
  "V48[1:1]": 1034,
  "*>4[2:1]": 1035,
  "*-6[2:1]": 1036,
  "pp1[2:3]": 1037,
  "q2[4:3]": 1038,
  ">8[8:11]": 1039,
  ">3[8:7]": 1040,
  "q8[8:5]": 1041,
  "*qq6[2:1]": 1042,
  "q4[16:3]": 1043,
  "pp5[2:3]": 1044,
  "*q2[8:1]": 1045,
  ">6[4:7]": 1046,
  "q1[16:5]": 1047,
  "V14[4:3]": 1048,
  ">2[2:3]": 1049,
  "v7[8:3]": 1050,
  "<3[4:13]": 1051,
  "v1[24:1]": 1052,
  "V36[2:1]": 1053,
  "V57[2:1]": 1054,
  "qq1[16:5]": 1055,
  "w5[32:3]": 1056,
  "q3[16:5]": 1057,
  "<5[16:7]": 1058,
  "*q4[8:3]": 1059,
  "-1[16:7]": 1060,
  "-4[16:7]": 1061,
  "-7[16:7]": 1062,
  "-5[4:13]": 1063,
  "V73[8:1]": 1064,
  "<5[0.3##0.15]": 1065,
  "<4[2:7]": 1066,
  "*V14[2:1]": 1067,
  "*v7[2:1]": 1068,
  "*<4[8:1]": 1069,
  "p8[2:3]": 1070,
  "-6[16:7]": 1071,
  ">8[4:15]": 1072,
  ">6[1:2]": 1073,
  "*q4[4:1]": 1074,
  "-5[24:1]": 1075,
  "pp6[2:3]": 1076,
  ">8[2:7]": 1077,
  ">5[2:7]": 1078,
  "*qq5[16:5]": 1079,
  ">8[1:2]": 1080,
  "-2[4:7]": 1081,
  "V41[1:1]": 1082,
  "V58[1:1]": 1083,
  "*qq5[8:5]": 1084,
  "v8[4:3]": 1085,
  "V73[16:3]": 1086,
  "s1[1:1]": 1087,
  "p7[4:3]": 1088,
  "q7[16:5]": 1089,
  ">7[8:7]": 1090,
  "<3[4:11]": 1091,
  "<4[4:9]": 1092,
  "<8[8:7]": 1093,
  "<1[4:9]": 1094,
  "qq5[16:7]": 1095,
  "<6[2:3]": 1096,
  "p8[1:1]": 1097,
  "z5[2:1]": 1098,
  "q8[16:3]": 1099,
  "p1[16:3]": 1100,
  ">3[0.1667##0.0833]": 1101,
  "<6[0.1667##0.0833]": 1102,
  ">8[8:9]": 1103,
  "*qq1[4:3]": 1104,
  ">2[16:5]": 1105,
  "v6[16:3]": 1106,
  "V26[2:1]": 1107,
  "q2[16:3]": 1108,
  "-4[32:1]": 1109,
  "V26[8:1]": 1110,
  "V27[2:1]": 1111,
  "V86[8:1]": 1112,
  "V41[4:5]": 1113,
  "*V73[16:3]": 1114,
  "v4[1:1]": 1115,
  "*p7[8:1]": 1116,
  "-1[1:2]": 1117,
  "q5[8:7]": 1118,
  "*>4[8:3]": 1119,
  "p3[1:1]": 1120,
  "V68[16:3]": 1121,
  "V75[8:3]": 1122,
  "*qq5[4:3]": 1123,
  "*V71[4:1]": 1124,
  "w1[16:3]": 1125,
  "<3[1:2]": 1126,
  "V63[8:1]": 1127,
  "pp3[8:7]": 1128,
  "*q8[4:1]": 1129,
  "qq3[16:3]": 1130,
  "-2[16:9]": 1131,
  "<5[16:9]": 1132,
  "w5[16:3]": 1133,
  "*q3[2:1]": 1134,
  "V61[8:3]": 1135,
  "V58[16:5]": 1136,
  "V25[8:1]": 1137,
  "*>5[2:1]": 1138,
  "z1[2:1]": 1139,
  "-5[4:11]": 1140,
  "V41[16:3]": 1141,
  "z1[4:1]": 1142,
  "p2[16:5]": 1143,
  "qq3[16:5]": 1144,
  "v4[8:5]": 1145,
  "V63[2:1]": 1146,
  "*v7[4:1]": 1147,
  "z6[8:1]": 1148,
  "q2[8:5]": 1149,
  "s6[2:1]": 1150,
  "p7[16:3]": 1151,
  "<3[8:9]": 1152,
  "-3[0.1667##0.0833]": 1153,
  "qq5[16:3]": 1154,
  "V85[4:3]": 1155,
  "p3[16:5]": 1156,
  "*V14[8:3]": 1157,
  "q8[4:5]": 1158,
  "V46[16:3]": 1159,
  "v4[16:5]": 1160,
  "s1[4:5]": 1161,
  "p3[16:1]": 1162,
  "V84[4:3]": 1163,
  "<8[16:7]": 1164,
  "-5[16:7]": 1165,
  "-1[4:13]": 1166,
  "V17[8:3]": 1167,
  "-3[4:13]": 1168,
  ">5[3:1]": 1169,
  "V26[4:3]": 1170,
  "V72[2:1]": 1171,
  "pp7[4:5]": 1172,
  "*-1[2.2105##0.1579]": 1173,
  "*V74[16:3]": 1174,
  "V61[8:1]": 1175,
  "*-1[8:1]": 1176,
  "p2[8:5]": 1177,
  "*-5[8:3]": 1178,
  "v2[8:5]": 1179,
  "z7[4:1]": 1180,
  "*-8[8:3]": 1181,
  "V47[16:3]": 1182,
  "qq8[16:7]": 1183,
  "*<4[2:1]": 1184,
  "w7[4:1]": 1185,
  "w2[4:1]": 1186,
  "*z4[2:1]": 1187,
  ">6[8:13]": 1188,
  "q3[8:5]": 1189,
  "V24[8:3]": 1190,
  ">4[16:9]": 1191,
  "*<6[4:1]": 1192,
  "q7[1:1]": 1193,
  "qq2[16:5]": 1194,
  "z6[4:5]": 1195,
  "*p1[8:1]": 1196,
  "V41[16:5]": 1197,
  "V25[8:3]": 1198,
  ">8[1:3]": 1199,
  "<8[4:7]": 1200,
  "*q1[4:1]": 1201,
  "q8[16:5]": 1202,
  "V74[8:3]": 1203,
  "V48[4:3]": 1204,
  "<2[16:9]": 1205,
  "p3[12:1]": 1206,
  "p4[8:7]": 1207,
  "*p3[8:1]": 1208,
  "<2[8:9]": 1209,
  "*q8[2:1]": 1210,
  "-8[4:13]": 1211,
  "-8[8:9]": 1212,
  "pp3[16:5]": 1213,
  ">7[16:9]": 1214,
  "V31[16:3]": 1215,
  "V64[16:3]": 1216,
  "q6[16:5]": 1217,
  "qq4[16:7]": 1218,
  "V58[16:3]": 1219,
  "*-4[4:1]": 1220,
  "-8[16:9]": 1221,
  "-7[4:13]": 1222,
  "<4[3:1]": 1223,
  "V37[8:3]": 1224,
  "v5[4:5]": 1225,
  "*V62[16:3]": 1226,
  "*V63[16:3]": 1227,
  "*qq1[4:1]": 1228,
  "-2[1:2]": 1229,
  "-4[8:11]": 1230,
  "*p8[2:1]": 1231,
  "V83[8:3]": 1232,
  "V31[8:3]": 1233,
  ">6[4:11]": 1234,
  "v4[4:5]": 1235,
  "s8[4:1]": 1236,
  "*qq2[8:5]": 1237,
  "qq1[16:7]": 1238,
  "pp1[16:7]": 1239,
  ">3[4:7]": 1240,
  ">5[2:5]": 1241,
  "v6[8:5]": 1242,
  "-7[4:7]": 1243,
  "pp6[8:7]": 1244,
  ">3[8:9]": 1245,
  "V28[16:3]": 1246,
  "V71[16:3]": 1247,
  "z4[2:3]": 1248,
  ">4[4:13]": 1249,
  "<5[4:13]": 1250,
  "V26[16:5]": 1251,
  "V27[8:1]": 1252,
  "s7[4:3]": 1253,
  "s8[2:1]": 1254,
  "q1[8:5]": 1255,
  "V15[1:1]": 1256,
  "p4[16:7]": 1257,
  "p4[16:9]": 1258,
  ">6[4:13]": 1259,
  ">7[1:2]": 1260,
  "z8[16:3]": 1261,
  "<2[4:7]": 1262,
  "qq5[4:11]": 1263,
  ">4[4:11]": 1264,
  "V73[8:3]": 1265,
  "<4[8:11]": 1266,
  "V84[8:5]": 1267,
  "pp4[1:2]": 1268,
  "-6[0.1667##0.0833]": 1269,
  ">7[8:9]": 1270,
  "*q5[4:3]": 1271,
  "-6[4:9]": 1272,
  "w8[16:1]": 1273,
  "*<8[8:3]": 1274,
  "z6[16:3]": 1275,
  "<1[4:13]": 1276,
  "q6[2:3]": 1277,
  ">6[16:9]": 1278,
  "<4[2:5]": 1279,
  "q6[6:1]": 1280,
  "v3[24:1]": 1281,
  "p3[6:1]": 1282,
  "V53[16:3]": 1283,
  "*-5[32:3]": 1284,
  "V48[16:5]": 1285,
  "<3[16:7]": 1286,
  "v2[16:1]": 1287,
  "v7[16:3]": 1288,
  "qq7[16:7]": 1289,
  "<6[16:7]": 1290,
  "q6[16:1]": 1291,
  "-4[3:1]": 1292,
  "*qq7[4:1]": 1293,
  "w5[4:5]": 1294,
  "-5[32:1]": 1295,
  "*V71[8:1]": 1296,
  "*V64[8:1]": 1297,
  "w3[2:1]": 1298,
  ">5[8:9]": 1299,
  "*-7[2.2105##0.1579]": 1300,
  "*-8[2.2105##0.1579]": 1301,
  "*-4[1.1538##0.1923]": 1302,
  "*v5[2:1]": 1303,
  "-2[0.8571##0.2143]": 1304,
  "-7[0.8571##0.2143]": 1305,
  "*>1[4:1]": 1306,
  "*qq1[8:5]": 1307,
  "v5[16:5]": 1308,
  "<8[4:9]": 1309,
  "V15[8:5]": 1310,
  "*p4[2:1]": 1311,
  "p7[1:1]": 1312,
  "pp5[4:7]": 1313,
  ">8[4:9]": 1314,
  "qq5[8:11]": 1315,
  "p2[16:7]": 1316,
  "*p3[4:1]": 1317,
  ">2[16:7]": 1318,
  "pp6[4:7]": 1319,
  "pp1[16:9]": 1320,
  "p5[8:7]": 1321,
  "V36[8:1]": 1322,
  "V15[4:5]": 1323,
  "V84[4:5]": 1324,
  "-7[8:9]": 1325,
  ">5[1:3]": 1326,
  ">3[16:9]": 1327,
  "w6[4:1]": 1328,
  "*<1[4:1]": 1329,
  "p2[1:1]": 1330,
  "*p6[2:1]": 1331,
  "*p1[8:3]": 1332,
  "<8[1:2]": 1333,
  "qq5[1:2]": 1334,
  "qq6[16:5]": 1335,
  "pp8[4:11]": 1336,
  ">8[32:3]": 1337,
  "s5[2:3]": 1338,
  "s1[8:7]": 1339,
  ">5[8:11]": 1340,
  "V85[1:1]": 1341,
  "-4[4:9]": 1342,
  "V46[1:1]": 1343,
  "V53[1:1]": 1344,
  "-4[4:11]": 1345,
  "V37[16:3]": 1346,
  "<1[1:3]": 1347,
  "pp8[8:11]": 1348,
  "<3[2:7]": 1349,
  "<1[24:5]": 1350,
  "<1[2:7]": 1351,
  "s1[16:3]": 1352,
  "<1[8:15]": 1353,
  "w8[12:1]": 1354,
  "w6[8:3]": 1355,
  "*qq6[8:3]": 1356,
  ">4[16:7]": 1357,
  "*qq6[4:1]": 1358,
  "*<5[8:3]": 1359,
  "qq6[8:7]": 1360,
  "pp5[16:7]": 1361,
  "*v5[4:1]": 1362,
  ">1[1:2]": 1363,
  "-2[4:9]": 1364,
  "-3[4:9]": 1365,
  "q7[8:5]": 1366,
  "pp7[16:5]": 1367,
  "*p6[8:3]": 1368,
  "*v8[4:1]": 1369,
  "<1[8:11]": 1370,
  "v1[4:3]": 1371,
  "V53[4:3]": 1372,
  "*qq8[8:3]": 1373,
  "*p5[4:1]": 1374,
  "v8[24:1]": 1375,
  "v6[24:1]": 1376,
  "z3[4:3]": 1377,
  "s6[4:3]": 1378,
  "*p4[8:3]": 1379,
  "qq8[8:1]": 1380,
  "p7[8:5]": 1381,
  "w5[1:1]": 1382,
  "p6[16:5]": 1383,
  "*-6[32:3]": 1384,
  "s4[4:3]": 1385,
  "s4[8:1]": 1386,
  "*-7[32:3]": 1387,
  "V27[8:3]": 1388,
  "*>3[16:3]": 1389,
  "q5[12:1]": 1390,
  "w4[16:3]": 1391,
  "-6[2:5]": 1392,
  "-1[16:9]": 1393,
  "q5[1:2]": 1394,
  "V52[16:3]": 1395,
  "V82[8:3]": 1396,
  "-8[16:13]": 1397,
  "p4[6:1]": 1398,
  "-5": 1399,
  "-7": 1400,
  "V36[4:3]": 1401,
  "w8[1:1]": 1402,
  "w1[16:1]": 1403,
  "v6[16:5]": 1404,
  "*<6[2:1]": 1405,
  "*V68[2:1]": 1406,
  "V75[4:3]": 1407,
  "*qq6[4:5]": 1408,
  "q2[1:1]": 1409,
  "qq8[16:9]": 1410,
  "pp4[4:9]": 1411,
  "qq5[4:9]": 1412,
  "pp4[8:11]": 1413,
  "p5[16:9]": 1414,
  "pp2[16:5]": 1415,
  ">7[2:7]": 1416,
  "*q5[2:1]": 1417,
  "s6[1:1]": 1418,
  "p5[2:3]": 1419,
  "*v4[4:1]": 1420,
  "-2[16:7]": 1421,
  "<4[8:15]": 1422,
  "*q8[8:3]": 1423,
  "*q3[8:1]": 1424,
  "qq1[1:2]": 1425,
  "z4[16:1]": 1426,
  "qq7[2:3]": 1427,
  "pp2[2:3]": 1428,
  "qq4[16:3]": 1429,
  "<1[32:3]": 1430,
  ">5[16:11]": 1431,
  "V53[4:5]": 1432,
  "V14[1:1]": 1433,
  "<7[8:7]": 1434,
  "*V35[2:1]": 1435,
  "qq8[2:3]": 1436,
  "v7[4:3]": 1437,
  "-6[8:9]": 1438,
  "s2[4:1]": 1439,
  "*p5[8:3]": 1440,
  "V41[8:5]": 1441,
  "V58[8:5]": 1442,
  "*V24[2:1]": 1443,
  "qq1[8:11]": 1444,
  "<2[4:13]": 1445,
  ">7[4:13]": 1446,
  "V83[8:1]": 1447,
  ">1[8:7]": 1448,
  "q8[1:1]": 1449,
  "*qq5[1:1]": 1450,
  "p1[16:5]": 1451,
  "z4[8:7]": 1452,
  "<2[4:11]": 1453,
  "q6[8:7]": 1454,
  "w5[12:1]": 1455,
  "*q4[2:1]": 1456,
  "*qq1[8:3]": 1457,
  "*qq5[8:1]": 1458,
  "q1[1:1]": 1459,
  "V46[4:5]": 1460,
  "z3[16:3]": 1461,
  "q3[4:5]": 1462,
  "pp8[16:9]": 1463,
  "V31[4:3]": 1464,
  ">8[2:5]": 1465,
  "pp6[16:3]": 1466,
  "*qq2[2:1]": 1467,
  "s4[2:1]": 1468,
  "pp3[2:3]": 1469,
  "q4[8:7]": 1470,
  "<5[4:11]": 1471,
  "pp7[1:1]": 1472,
  "V13[8:3]": 1473,
  "w8[32:3]": 1474,
  "w1[32:3]": 1475,
  "s6[8:3]": 1476,
  "*p4[4:1]": 1477,
  "v7[24:1]": 1478,
  "v2[24:1]": 1479,
  "s7[8:5]": 1480,
  "q5[16:1]": 1481,
  "<3[16:9]": 1482,
  ">5[24:5]": 1483,
  "-4[4:13]": 1484,
  "p1[4:5]": 1485,
  "-2[8:9]": 1486,
  "V36[8:3]": 1487,
  "q5[16:9]": 1488,
  "V63[8:3]": 1489,
  "p1[12:1]": 1490,
  "p4[16:1]": 1491,
  ">3[16:7]": 1492,
  "qq2[8:7]": 1493,
  "V37[8:1]": 1494,
  "V28[8:3]": 1495,
  "<1[16:9]": 1496,
  "-7[6:1]": 1497,
  "q5[6:1]": 1498,
  ">2[3:1]": 1499,
  "-6[32:1]": 1500,
  ">5[8:13]": 1501,
  "-3[1:3]": 1502,
  "<1[8:13]": 1503,
  "*q7[4:1]": 1504,
  "<7[4:7]": 1505,
  ">1[4:11]": 1506,
  "V75[4:5]": 1507,
  "-1[3:1]": 1508,
  ">5[12:5]": 1509,
  "s3[8:1]": 1510,
  "pp7[8:7]": 1511,
  "v5[8:5]": 1512,
  ">3[3:1]": 1513,
  "<6[3:1]": 1514,
  "*q6[4:1]": 1515,
  ">6[3:1]": 1516,
  ">8[3:1]": 1517,
  "qq7[16:3]": 1518,
  "V72[8:1]": 1519,
  "*q1[2:1]": 1520,
  "v2[16:3]": 1521,
  "V14[8:1]": 1522,
  "pp2[16:3]": 1523,
  "-3": 1524,
  "-6[0.3##0.15]": 1525,
  "-3[0.3##0.15]": 1526,
  "*-2[2.2105##0.1579]": 1527,
  "-4[1.1538##0.1923]": 1528,
  "*-5[1.1538##0.1923]": 1529,
  "*-6[1.1538##0.1923]": 1530,
  "-3[1.1538##0.1923]": 1531,
  "-6[1.1538##0.1923]": 1532,
  "-5[0.7692##0.3846]": 1533,
  "*-4[1.5385##0.1923]": 1534,
  "-3[2##0.2]": 1535,
  "-6[1.7143##0.2143]": 1536,
  "-3[1.7143##0.2143]": 1537,
  "-4[1.7143##0.2143]": 1538,
  "-5[1.7143##0.2143]": 1539,
  "p4[4:11]": 1540,
  "s1[16:5]": 1541,
  "-7[1:2]": 1542,
  "-1[4:11]": 1543,
  "V75[16:3]": 1544,
  ">7[4:11]": 1545,
  "*p1[2:1]": 1546,
  "*>8[8:1]": 1547,
  "v4[12:1]": 1548,
  "v1[16:7]": 1549,
  "p3[16:7]": 1550,
  "qq8[8:9]": 1551,
  "V58[4:5]": 1552,
  "*p7[4:1]": 1553,
  "qq5[16:13]": 1554,
  "w3[4:1]": 1555,
  "*v3[4:1]": 1556,
  "q3[1:1]": 1557,
  "p6[1:1]": 1558,
  "*q1[8:3]": 1559,
  "w4[1:1]": 1560,
  "*-6[4:3]": 1561,
  "*qq4[16:5]": 1562,
  "<4[1:3]": 1563,
  "w4[4:5]": 1564,
  "-2[4:11]": 1565,
  "V52[8:3]": 1566,
  "V28[4:5]": 1567,
  "z6[1:1]": 1568,
  "*-5[4:3]": 1569,
  "q4[8:9]": 1570,
  "q1[8:7]": 1571,
  "-3[8:9]": 1572,
  "V73[2:1]": 1573,
  "*>3[8:3]": 1574,
  "qq5[4:13]": 1575,
  "<8[16:9]": 1576,
  "*qq8[4:1]": 1577,
  "qq3[8:7]": 1578,
  "v6[4:3]": 1579,
  "p2[2:3]": 1580,
  "-4[1.6##0.2]": 1581,
  "-6[0##0.2]": 1582,
  "z8[8:5]": 1583,
  "<2[8:11]": 1584,
  "V68[8:3]": 1585,
  "v8[6:1]": 1586,
  "p2[4:5]": 1587,
  "z8[4:5]": 1588,
  "-3[2:7]": 1589,
  "q6[12:1]": 1590,
  "V42[2:1]": 1591,
  "z3[8:5]": 1592,
  ">6[16:11]": 1593,
  ">7[8:13]": 1594,
  "qq1[16:9]": 1595,
  ">6[4:9]": 1596,
  "*-6[16:1]": 1597,
  "*qq5[4:5]": 1598,
  "*q3[8:3]": 1599,
  "q1[2:3]": 1600,
  "-7[4:9]": 1601,
  "w1[12:1]": 1602,
  "*pp5[4:1]": 1603,
  "V17[2:3]": 1604,
  "V82[2:3]": 1605,
  "pp2[16:9]": 1606,
  "pp5[8:9]": 1607,
  "V26[8:3]": 1608,
  "V85[8:1]": 1609,
  "*v7[8:3]": 1610,
  "p8[32:3]": 1611,
  "s5[4:7]": 1612,
  "<2[1:2]": 1613,
  "q6[16:7]": 1614,
  "qq4[4:15]": 1615,
  "*p8[4:1]": 1616,
  "q7[4:7]": 1617,
  "z5[8:1]": 1618,
  "qq1[4:11]": 1619,
  "q6[32:3]": 1620,
  "q2[32:3]": 1621,
  "-5[1:3]": 1622,
  "*p2[4:1]": 1623,
  "V25[4:3]": 1624,
  ">4[3:1]": 1625,
  "<2[6:1]": 1626,
  "V14[8:5]": 1627,
  "pp8[4:9]": 1628,
  "z2[4:3]": 1629,
  "pp4[8:13]": 1630,
  "z5[4:5]": 1631,
  "<6[4:11]": 1632,
  "*-8[32:3]": 1633,
  "qq4[3:1]": 1634,
  "qq5[3:1]": 1635,
  "pp4[3:1]": 1636,
  "pp8[1:2]": 1637,
  "s4[16:3]": 1638,
  "*-7[8:3]": 1639,
  "*>8[2:1]": 1640,
  "*qq8[4:3]": 1641,
  "<5[8:11]": 1642,
  "q7[4:5]": 1643,
  "v5[12:1]": 1644,
  "-6[4:15]": 1645,
  "*>3[6:1]": 1646,
  "*>4[6:1]": 1647,
  "-6[2:7]": 1648,
  "v2[4:5]": 1649,
  "<7[32:5]": 1650,
  "-5[16:13]": 1651,
  "-2[4:15]": 1652,
  "qq2[1:1]": 1653,
  "V62[8:1]": 1654,
  "-2[2:5]": 1655,
  "-8[3:1]": 1656,
  "V82[4:5]": 1657,
  "-8[4:11]": 1658,
  "*qq1[8:1]": 1659,
  "-2[2:7]": 1660,
  "-5[2:7]": 1661,
  "-6[4:13]": 1662,
  "v4[6:1]": 1663,
  "-5[3:1]": 1664,
  "<6[4:7]": 1665,
  "V24[4:3]": 1666,
  "w5[8:7]": 1667,
  "-1[32:1]": 1668,
  "-4[0.283##0.283]": 1669,
  "-5[0.283##0.283]": 1670,
  "*V31[8:1]": 1671,
  "*V17[8:1]": 1672,
  "*V28[8:1]": 1673,
  "*-2[2:1]": 1674,
  "w2[2:1]": 1675,
  "*qq7[2:1]": 1676,
  "V72[4:3]": 1677,
  "z3[16:5]": 1678,
  "-6[2.4##0.2]": 1679,
  "*v4[2:1]": 1680,
  "*v8[2:1]": 1681,
  "V74[16:3]": 1682,
  "*z5[8:1]": 1683,
  "*w1[8:1]": 1684,
  ">1[4:9]": 1685,
  "V16[8:3]": 1686,
  "V38[16:5]": 1687,
  "*p4[8:5]": 1688,
  "v8[16:7]": 1689,
  "pp8[16:7]": 1690,
  "<7[16:7]": 1691,
  "<3[8:13]": 1692,
  "qq4[8:9]": 1693,
  "<1[4:15]": 1694,
  "-7[4:15]": 1695,
  "z8[2:3]": 1696,
  "pp6[8:11]": 1697,
  "w7[2:1]": 1698,
  "*>8[2:3]": 1699,
  "q4[2:3]": 1700,
  ">4[4:9]": 1701,
  "v1[8:5]": 1702,
  "<7[1:2]": 1703,
  "<6[1:2]": 1704,
  "s5[16:1]": 1705,
  "-5[4:15]": 1706,
  "V41[4:7]": 1707,
  "V58[4:7]": 1708,
  "-1[32:5]": 1709,
  "qq3[4:7]": 1710,
  "-5[4:9]": 1711,
  ">2[8:7]": 1712,
  ">5[4:15]": 1713,
  "v8[4:5]": 1714,
  "V85[16:3]": 1715,
  "<1[8:19]": 1716,
  "qq1[4:13]": 1717,
  "*<7[8:3]": 1718,
  ">8[16:11]": 1719,
  "*p5[2:1]": 1720,
  "-3[0##0.2]": 1721,
  "*<5[2:1]": 1722,
  ">7[8:11]": 1723,
  ">4[8:9]": 1724,
  "z5[8:3]": 1725,
  "p5[16:1]": 1726,
  "*>3[2:1]": 1727,
  "V62[4:3]": 1728,
  "V51[8:7]": 1729,
  "qq7[16:5]": 1730,
  "*V57[4:1]": 1731,
  "*>4[16:3]": 1732,
  "z7[2:1]": 1733,
  "p3[8:7]": 1734,
  "V25[16:3]": 1735,
  "-5[0.1667##0.1667]": 1736,
  "<2[2:7]": 1737,
  "p4[4:13]": 1738,
  "s3[16:5]": 1739,
  "V47[8:3]": 1740,
  "pp7[32:3]": 1741,
  "<5[8:13]": 1742,
  "<1[2:5]": 1743,
  "z3[4:5]": 1744,
  "*<3[2:1]": 1745,
  "v1[2:3]": 1746,
  "s3[16:3]": 1747,
  "z2[8:1]": 1748,
  "<8[48:5]": 1749,
  "q7[2:3]": 1750,
  "*qq2[16:5]": 1751,
  "*v7[16:3]": 1752,
  "V74[4:3]": 1753,
  "w4[32:3]": 1754,
  "v1[4:5]": 1755,
  "pp4[8:15]": 1756,
  "p8[8:7]": 1757,
  "v6[2:3]": 1758,
  "V71[8:3]": 1759,
  "-5[8:15]": 1760,
  ">5[32:5]": 1761,
  "-8[48:7]": 1762,
  "V84[1:1]": 1763,
  "<5[8:9]": 1764,
  "qq6[4:7]": 1765,
  "pp8[16:3]": 1766,
  "*<7[12:1]": 1767,
  "V51[6:1]": 1768,
  "<7[2:7]": 1769,
  "-5[0.7627##0.2542]": 1770,
  "*p8[8:3]": 1771,
  "s3[1:1]": 1772,
  "-4[16:11]": 1773,
  "v4[32:3]": 1774,
  "V85[8:5]": 1775,
  "p1[1:1]": 1776,
  "V38[8:1]": 1777,
  "pp6[16:11]": 1778,
  "q1[16:7]": 1779,
  "*-1[16:7]": 1780,
  ">8[24:5]": 1781,
  "p4[12:1]": 1782,
  "V64[16:5]": 1783,
  "pp1[4:7]": 1784,
  "p7[4:5]": 1785,
  ">4[8:11]": 1786,
  "*pp4[8:3]": 1787,
  "V57[16:3]": 1788,
  "qq6[12:1]": 1789,
  "w6[2:1]": 1790,
  "*>2[4:1]": 1791,
  "-3[4:15]": 1792,
  "-3[16:11]": 1793,
  "qq4[4:7]": 1794,
  "-4[2:5]": 1795,
  "v3[8:5]": 1796,
  "v5[32:3]": 1797,
  "-3[32:1]": 1798,
  "*p1[4:1]": 1799,
  "-6[1:3]": 1800,
  "pp4[12:7]": 1801,
  "*pp4[8:1]": 1802,
  "p8[4:7]": 1803,
  "-8[2:7]": 1804,
  "v1[1:1]": 1805,
  ">1[16:9]": 1806,
  "<7[16:9]": 1807,
  "*-7[16:1]": 1808,
  "-2[4:13]": 1809,
  "-2[8:13]": 1810,
  "*qq3[16:5]": 1811,
  ">1[8:9]": 1812,
  "V86[1:1]": 1813,
  "-2[16:13]": 1814,
  "-6[16:11]": 1815,
  "pp2[16:7]": 1816,
  "*V64[4:1]": 1817,
  "<7[3:1]": 1818,
  "*q7[8:1]": 1819,
  "<4[12:5]": 1820,
  "-4[24:1]": 1821,
  ">3[32:5]": 1822,
  "<6[32:5]": 1823,
  "p7[12:1]": 1824,
  "pp7[16:3]": 1825,
  "-8[32:1]": 1826,
  "V38[16:3]": 1827,
  "<3[3:1]": 1828,
  "qq1[12:7]": 1829,
  "-2": 1830,
  "-1": 1831,
  "*V57[8:1]": 1832,
  "*V53[8:1]": 1833,
  "*V13[8:1]": 1834,
  "*z5[4:1]": 1835,
  "*V48[4:1]": 1836,
  "*V53[4:1]": 1837,
  "*-4[0.9474##0.1579]": 1838,
  "-4[2.2105##0.1579]": 1839,
  "*-3[2.2105##0.1579]": 1840,
  "*-5[2.2105##0.1579]": 1841,
  "*-6[1.2632##0.1579]": 1842,
  "-6[0.7692##0.3846]": 1843,
  "-4[0.7692##0.3846]": 1844,
  "*qq4[0.7692##0.3846]": 1845,
  "*qq3[0.7692##0.3846]": 1846,
  "*-5[1.5385##0.1923]": 1847,
  "*-3[1.5385##0.1923]": 1848,
  "*-6[1.5385##0.1923]": 1849,
  "-4[0.7692##0.1923]": 1850,
  "-5[0.7692##0.1923]": 1851,
  "*-4[2.8##0.2]": 1852,
  "*-5[2.8##0.2]": 1853,
  "*-6[2.8##0.2]": 1854,
  "*-3[2.8##0.2]": 1855,
  "*v4[2.8##0.2]": 1856,
  "-2[1.2##0.2]": 1857,
  "*-8[1.2##0.2]": 1858,
  "*v2[2:1]": 1859,
  "-4[0##0.2143]": 1860,
  "-5[0##0.2143]": 1861,
  "-6[0.8571##0.2143]": 1862,
  "-3[0.8571##0.2143]": 1863,
  "-7[1.2857##0.2143]": 1864,
  "-1[1.7143##0.2143]": 1865,
  "-2[1.7143##0.2143]": 1866,
  "-7[1.7143##0.2143]": 1867,
  "-8[1.7143##0.2143]": 1868,
  "-8[0##0.2143]": 1869,
  "-1[0##0.2143]": 1870,
  "-4[2.0225##0.1685]": 1871,
  "-8[2.0225##0.1685]": 1872,
  "-1[1.0112##0.1685]": 1873,
  "-8[1.0112##0.1685]": 1874,
  "-6[0.5056##0.1685]": 1875,
  "-5[0.8427##0.1685]": 1876,
  "-4[0.8427##0.1685]": 1877,
  "-3[0.5056##0.1685]": 1878,
  "-8[0##0.1685]": 1879,
  "-1[0##0.1685]": 1880,
  ">4[0.6742##0.1685]": 1881,
  "<5[0.6742##0.1685]": 1882,
  "-8[0.6742##0.1685]": 1883,
  "-1[0.6742##0.1685]": 1884,
  "-1[0##0.0843]": 1885,
  "V64[6:1]": 1886,
  "*pp1[8:5]": 1887,
  "-3[1:2]": 1888,
  "-6[1:2]": 1889,
  "-5[8:11]": 1890,
  "-4[48:1]": 1891,
  "qq6[8:9]": 1892,
  "V28[1:1]": 1893,
  "V41[8:9]": 1894,
  "V58[8:9]": 1895,
  "qq4[16:9]": 1896,
  "pp3[16:9]": 1897,
  "V61[16:5]": 1898,
  ">7[8:15]": 1899,
  "<2[8:15]": 1900,
  "q8[8:13]": 1901,
  "*V58[2:1]": 1902,
  "w1[8:5]": 1903,
  "<5[8:17]": 1904,
  "q7[16:7]": 1905,
  "z4[16:9]": 1906,
  "*v1[4:1]": 1907,
  "*q7[2:1]": 1908,
  "*v6[4:3]": 1909,
  "qq2[16:9]": 1910,
  "qq5[16:11]": 1911,
  ">2[8:9]": 1912,
  "V36[96:47]": 1913,
  "V27[96:47]": 1914,
  "pp4[16:13]": 1915,
  "V46[16:5]": 1916,
  "qq3[8:11]": 1917,
  "qq6[16:7]": 1918,
  "*V24[8:3]": 1919,
  "<6[16:9]": 1920,
  ">3[1:2]": 1921,
  "V47[4:3]": 1922,
  "V25[4:5]": 1923,
  "pp5[16:3]": 1924,
  "pp3[4:7]": 1925,
  "pp7[4:7]": 1926,
  "-4[0.6316##0.1579]": 1927,
  "-8[4:9]": 1928,
  "w5[2:3]": 1929,
  "-8[32:5]": 1930,
  "-4[32:5]": 1931,
  "qq6[2:3]": 1932,
  ">1[1:3]": 1933,
  "s7[16:5]": 1934,
  "q5[1:3]": 1935,
  "qq8[4:7]": 1936,
  "qq8[4:11]": 1937,
  "*-7[4:3]": 1938,
  "w5[8:9]": 1939,
  "p2[4:11]": 1940,
  "p6[4:11]": 1941,
  ">8[8:19]": 1942,
  "*v8[8:3]": 1943,
  "<1[8:9]": 1944,
  "q8[8:7]": 1945,
  "<3[1:3]": 1946,
  "*p2[8:1]": 1947,
  "pp7[16:7]": 1948,
  "v1[16:5]": 1949,
  "-4[1.2##0.2]": 1950,
  "-4[0##0.2]": 1951,
  "-5[0##0.2]": 1952,
  "-8[0.8##0.2]": 1953,
  "-5[0.8##0.2]": 1954,
  "*>1[2:1]": 1955,
  "qq2[2:3]": 1956,
  "<3[4:9]": 1957,
  "-6[4:11]": 1958,
  "z1[8:3]": 1959,
  "qq3[8:9]": 1960,
  "*qq3[8:3]": 1961,
  "v8[12:1]": 1962,
  ">7[4:9]": 1963,
  "V48[8:7]": 1964,
  ">8[8:15]": 1965,
  "-5[8:13]": 1966,
  "V16[8:1]": 1967,
  ">6[2:7]": 1968,
  "v7[8:5]": 1969,
  "*p5[8:1]": 1970,
  "*V31[4:1]": 1971,
  "-4[0.1667##0.1667]": 1972,
  "s1[2:3]": 1973,
  "*V35[4:3]": 1974,
  "<6[8:9]": 1975,
  "-1[4:9]": 1976,
  "-5[384:47]": 1977,
  "<3[32:9]": 1978,
  "s8[1:1]": 1979,
  "<1[48:5]": 1980,
  "p3[16:9]": 1981,
  "V52[1:1]": 1982,
  "V41[8:7]": 1983,
  "V58[8:7]": 1984,
  "-4[8:13]": 1985,
  "*<4[8:3]": 1986,
  ">6[6:1]": 1987,
  "*-1[8:3]": 1988,
  "z3[8:7]": 1989,
  "-6[8:11]": 1990,
  "q1[32:3]": 1991,
  "*qq6[16:5]": 1992,
  "qq6[4:15]": 1993,
  "V48[8:5]": 1994,
  "v1[4:7]": 1995,
  ">1[1:4]": 1996,
  ">5[8:15]": 1997,
  "s8[4:5]": 1998,
  "qq3[16:9]": 1999,
  "s3[16:9]": 2000,
  ">5[16:19]": 2001,
  "p2[12:1]": 2002,
  "w4[4:7]": 2003,
  "p7[32:3]": 2004,
  "p3[32:3]": 2005,
  "<1[3:1]": 2006,
  "<3[4:15]": 2007,
  "s6[4:5]": 2008,
  "<5[2:5]": 2009,
  "V64[8:5]": 2010,
  ">5[0.7627##0.2542]": 2011,
  "-4[0.7627##0.2542]": 2012,
  "q4[16:9]": 2013,
  "*<8[6:1]": 2014,
  "<4[24:5]": 2015,
  "pp6[16:9]": 2016,
  "q5[8:9]": 2017,
  "s7[4:5]": 2018,
  "z6[8:5]": 2019,
  "pp3[8:11]": 2020,
  "V38[4:3]": 2021,
  "*-6[8:3]": 2022,
  "-1[24:1]": 2023,
  "qq5[8:13]": 2024,
  "pp6[32:3]": 2025,
  "s2[4:3]": 2026,
  "-1[8:11]": 2027,
  "p4[8:9]": 2028,
  ">5[8:17]": 2029,
  "-2[1:3]": 2030,
  "*V46[4:1]": 2031,
  "z5[16:3]": 2032,
  "qq5[12:7]": 2033,
  "*-4[16:1]": 2034,
  "*V68[8:1]": 2035,
  "*qq2[8:3]": 2036,
  "-4[8:15]": 2037,
  "p1[32:3]": 2038,
  "<8[8:9]": 2039,
  "V15[16:5]": 2040,
  "pp2[8:7]": 2041,
  "V62[8:3]": 2042,
  "V42[16:3]": 2043,
  "q3[8:7]": 2044,
  "p6[8:7]": 2045,
  "w5[6:1]": 2046,
  "pp4[4:13]": 2047,
  ">2[2:7]": 2048,
  "V74[8:5]": 2049,
  "-7[8:19]": 2050,
  "<8[4:15]": 2051,
  "qq8[8:11]": 2052,
  "qq4[8:11]": 2053,
  "<5[1:2]": 2054,
  "v6[4:5]": 2055,
  "p4[1:2]": 2056,
  "p3[2:3]": 2057,
  "V51[8:5]": 2058,
  "*q6[2:1]": 2059,
  "-7[2:5]": 2060,
  "-3[2:5]": 2061,
  "-5[2:5]": 2062,
  "q2[16:1]": 2063,
  ">1[2:5]": 2064,
  ">1[24:5]": 2065,
  "V63[16:3]": 2066,
  "p1[2:3]": 2067,
  "pp6[16:13]": 2068,
  "*>3[16:1]": 2069,
  "pp3[16:3]": 2070,
  "w5[4:7]": 2071,
  "-8[1:2]": 2072,
  "qq3[4:13]": 2073,
  "V57[4:3]": 2074,
  "q8[12:1]": 2075,
  "<5[1:3]": 2076,
  "z1[4:3]": 2077,
  "-4[8:31]": 2078,
  "-7[8:31]": 2079,
  "q2[2:3]": 2080,
  "w8[6:1]": 2081,
  ">7[3:1]": 2082,
  "*v5[8:3]": 2083,
  "V14[16:3]": 2084,
  "V42[8:3]": 2085,
  "*-7[16:3]": 2086,
  "-7[2:7]": 2087,
  "V35[16:5]": 2088,
  "*q5[16:5]": 2089,
  "V71[4:3]": 2090,
  "-3[4:11]": 2091,
  "V42[1:1]": 2092,
  "-6[16:13]": 2093,
  ">8[8:13]": 2094,
  "q5[4:11]": 2095,
  "qq1[4:9]": 2096,
  ">2[8:11]": 2097,
  "q5[12:5]": 2098,
  "s1[4:7]": 2099,
  "V15[4:7]": 2100,
  "<3[2:5]": 2101,
  ">3[8:11]": 2102,
  "*q2[4:1]": 2103,
  "q5[3:1]": 2104,
  "q2[12:1]": 2105,
  "q4[16:7]": 2106,
  ">5[32:3]": 2107,
  "pp7[2:3]": 2108,
  "<3[16:11]": 2109,
  "pp8[12:7]": 2110,
  "-6[0.283##0.283]": 2111,
  "-3[0.283##0.283]": 2112,
  "-2[0.283##0.283]": 2113,
  "-7[0.283##0.283]": 2114,
  "-6": 2115,
  "-4": 2116,
  "V73[4:3]": 2117,
  "w1[1:1]": 2118,
  "*V38[4:1]": 2119,
  "*pp7[2:1]": 2120,
  "*V46[8:1]": 2121,
  "-6[2.8##0.2]": 2122,
  "-8[1.2##0.2]": 2123,
  "*v6[1:1]": 2124,
  "*<2[8:1]": 2125,
  "*<6[4:3]": 2126,
  "*<5[4:3]": 2127,
  "V13[4:3]": 2128,
  "*V15[4:3]": 2129,
  "*qq8[8:5]": 2130,
  "*w5[8:1]": 2131,
  "*w8[8:1]": 2132,
  "V75[8:5]": 2133,
  "-7[8:11]": 2134,
  "-2[8:11]": 2135,
  "*V16[8:3]": 2136,
  "-6[384:869]": 2137,
  "-3[384:869]": 2138,
  "-7[384:869]": 2139,
  "-2[384:869]": 2140,
  ">1[384:869]": 2141,
  "<8[384:869]": 2142,
  "w5[2.0513##0.1282]": 2143,
  "w4[2.0513##0.1282]": 2144,
  "V14[8:9]": 2145,
  "V85[8:9]": 2146,
  "s1[8:15]": 2147,
  "*qq7[8:5]": 2148,
  "w8[8:5]": 2149,
  ">4[8:17]": 2150,
  "<2[4:15]": 2151,
  "V36[16:3]": 2152,
  "V25[8:7]": 2153,
  "q8[4:7]": 2154,
  "*qq5[8:7]": 2155,
  "*<1[8:5]": 2156,
  "q3[2:3]": 2157,
  "*>2[4:5]": 2158,
  "V84[16:9]": 2159,
  "V15[16:9]": 2160,
  "V48[16:9]": 2161,
  "V14[2:3]": 2162,
  "V85[2:3]": 2163,
  "*v7[8:5]": 2164,
  "*>7[2:1]": 2165,
  ">4[1:2]": 2166,
  "*s4[4:1]": 2167,
  "*z4[8:3]": 2168,
  "pp8[32:9]": 2169,
  "-1[384:191]": 2170,
  "V83[4:3]": 2171,
  "<1[6:5]": 2172,
  "*>8[32:3]": 2173,
  "*<1[32:3]": 2174,
  "z8[16:1]": 2175,
  "s1[16:1]": 2176,
  "V82[1:1]": 2177,
  "p5[8:9]": 2178,
  "V15[8:9]": 2179,
  "V84[8:9]": 2180,
  ">6[1:3]": 2181,
  "*V14[1:1]": 2182,
  "V52[8:1]": 2183,
  "p1[16:7]": 2184,
  "v2[2:3]": 2185,
  "v8[16:5]": 2186,
  "-5[1.6##0.2]": 2187,
  "-1[2.4##0.2]": 2188,
  "-5[2##0.2]": 2189,
  "-3[1.6##0.2]": 2190,
  "-1[0##0.2]": 2191,
  "-4[0.8##0.2]": 2192,
  "*>4[4:3]": 2193,
  "V24[4:5]": 2194,
  "*-8[4:3]": 2195,
  "*qq6[1:1]": 2196,
  "w3[4:3]": 2197,
  "s6[8:5]": 2198,
  "*>5[8:3]": 2199,
  "V27[8:5]": 2200,
  "*V75[8:1]": 2201,
  "qq7[4:13]": 2202,
  "-4[384:47]": 2203,
  "z2[16:5]": 2204,
  "pp5[1:2]": 2205,
  "-1[0.1667##0.0833]": 2206,
  "-8[0.1667##0.0833]": 2207,
  "qq5[32:13]": 2208,
  "qq7[1:2]": 2209,
  "pp3[16:7]": 2210,
  "*qq5[16:7]": 2211,
  "*V35[16:3]": 2212,
  "pp1[16:3]": 2213,
  "qq2[32:3]": 2214,
  "<4[32:3]": 2215,
  ">4[8:13]": 2216,
  "p4[8:11]": 2217,
  "*v1[2:1]": 2218,
  "V53[2:3]": 2219,
  "V46[2:3]": 2220,
  "z7[16:3]": 2221,
  ">1[48:5]": 2222,
  ">8[48:5]": 2223,
  ">7[32:5]": 2224,
  "<2[32:5]": 2225,
  "<2[2:5]": 2226,
  "z8[8:7]": 2227,
  "-1[16:11]": 2228,
  "v1[8:11]": 2229,
  "V47[8:11]": 2230,
  "V52[4:3]": 2231,
  "V16[4:3]": 2232,
  "z2[8:5]": 2233,
  "V47[8:1]": 2234,
  "qq8[4:15]": 2235,
  "qq2[4:15]": 2236,
  ">5[16:13]": 2237,
  "v3[6:1]": 2238,
  "<4[16:11]": 2239,
  ">7[2:5]": 2240,
  "pp1[8:9]": 2241,
  "V86[8:3]": 2242,
  "v5[8:7]": 2243,
  "*<3[4:5]": 2244,
  ">6[24:5]": 2245,
  "*q2[8:3]": 2246,
  "s6[16:5]": 2247,
  "*qq7[8:3]": 2248,
  ">4[32:5]": 2249,
  "<1[32:5]": 2250,
  "w1[4:5]": 2251,
  ">8[32:11]": 2252,
  "pp5[8:11]": 2253,
  "s1[16:7]": 2254,
  "*v7[6:1]": 2255,
  "V15[6:1]": 2256,
  "q6[16:9]": 2257,
  "qq3[16:7]": 2258,
  "-8[0.7627##0.2542]": 2259,
  ">4[0.7627##0.2542]": 2260,
  "V47[16:5]": 2261,
  "w3[8:3]": 2262,
  "qq7[8:7]": 2263,
  "pp1[6:1]": 2264,
  "s3[8:9]": 2265,
  "qq6[16:9]": 2266,
  "-5[16:11]": 2267,
  "*q4[4:3]": 2268,
  "*V14[4:3]": 2269,
  "s4[4:5]": 2270,
  ">7[6:1]": 2271,
  "z6[6:1]": 2272,
  "pp6[8:9]": 2273,
  "-1[8:13]": 2274,
  ">3[32:9]": 2275,
  "<7[32:9]": 2276,
  "*s5[2:1]": 2277,
  "-8[16:11]": 2278,
  ">2[4:11]": 2279,
  "s8[4:3]": 2280,
  "*V24[4:3]": 2281,
  "s3[8:5]": 2282,
  "s4[8:5]": 2283,
  "V62[8:5]": 2284,
  "*z3[8:1]": 2285,
  "qq3[32:3]": 2286,
  "*q3[16:5]": 2287,
  "v7[2:3]": 2288,
  "*pp4[4:1]": 2289,
  "qq8[3:1]": 2290,
  "pp3[3:1]": 2291,
  "p7[3:1]": 2292,
  "-5[8:31]": 2293,
  "*<8[16:3]": 2294,
  "V72[8:3]": 2295,
  "v7[4:5]": 2296,
  "*q4[16:5]": 2297,
  "z8[1:1]": 2298,
  "*V64[8:3]": 2299,
  "*V28[8:3]": 2300,
  "z4[8:9]": 2301,
  "*V46[2:1]": 2302,
  "pp8[8:13]": 2303,
  "z2[1:1]": 2304,
  "-4[16:13]": 2305,
  "*qq1[4:5]": 2306,
  "*q7[8:3]": 2307,
  "w8[16:5]": 2308,
  "*V14[8:5]": 2309,
  "V37[1:1]": 2310,
  "p3[4:7]": 2311,
  "q8[16:1]": 2312,
  "z6[2:3]": 2313,
  "q3[4:13]": 2314,
  "<4[12:7]": 2315,
  "pp2[12:1]": 2316,
  "*v6[8:3]": 2317,
  "qq1[8:13]": 2318,
  "q7[6:1]": 2319,
  "p2[6:1]": 2320,
  "*-8[6:1]": 2321,
  "pp2[4:7]": 2322,
  "pp2[8:9]": 2323,
  "s3[8:7]": 2324,
  "<8[8:11]": 2325,
  ">2[4:13]": 2326,
  "z2[4:5]": 2327,
  "qq5[4:15]": 2328,
  "-4[12:5]": 2329,
  "*-6[4:5]": 2330,
  ">8[8:27]": 2331,
  "qq5[16:19]": 2332,
  "qq1[32:3]": 2333,
  "qq5[32:3]": 2334,
  "q2[4:11]": 2335,
  "w5[1:2]": 2336,
  "q2[8:7]": 2337,
  "V35[8:5]": 2338,
  "*-1[4:1]": 2339,
  "v6[4:7]": 2340,
  "V73[16:5]": 2341,
  "pp6[2:5]": 2342,
  "*pp4[8:5]": 2343,
  "V86[4:3]": 2344,
  "V42[4:3]": 2345,
  "<7[8:9]": 2346,
  "<1[16:11]": 2347,
  "V27[4:3]": 2348,
  "-4[4:15]": 2349,
  "-6[3:1]": 2350,
  "-2[3:1]": 2351,
  "-2[32:1]": 2352,
  ">7[16:13]": 2353,
  "-6[8:15]": 2354,
  "-1[8:15]": 2355,
  "-7[1:3]": 2356,
  "-4[1:3]": 2357,
  "qq6[16:3]": 2358,
  "V17[4:5]": 2359,
  "-8[2:5]": 2360,
  "*p1[16:5]": 2361,
  "qq3[12:7]": 2362,
  "*s5[4:1]": 2363,
  "s7[16:3]": 2364,
  "V51[2:3]": 2365,
  "-1[1:3]": 2366,
  "p2[16:9]": 2367,
  "*>2[2:1]": 2368,
  "V35[4:13]": 2369,
  "<2[3:1]": 2370,
  "-3[3:1]": 2371,
  "V16[16:3]": 2372,
  "V28[4:11]": 2373,
  "-4[2:7]": 2374,
  "pp4[16:11]": 2375,
  "<5[16:11]": 2376,
  "p4[16:11]": 2377,
  "-7[3:1]": 2378,
  "q2[4:5]": 2379,
  "q5[8:11]": 2380,
  "*z4[4:1]": 2381,
  "*V75[4:1]": 2382,
  "-1[4:15]": 2383,
  "-6[384:47]": 2384,
  "<8[2:13]": 2385,
  "<8[3:1]": 2386,
  "<4[3:2]": 2387,
  "w1[6:1]": 2388,
  "V85[8:7]": 2389,
  "V75[16:5]": 2390,
  "v6[1:1]": 2391,
  ">3[4:11]": 2392,
  "v2[32:3]": 2393,
  "v1[32:3]": 2394,
  "*V35[4:5]": 2395,
  "V13[1:1]": 2396,
  "v5[1:1]": 2397,
  "V14[8:7]": 2398,
  "*qq4[16:3]": 2399,
  "*z4[16:3]": 2400,
  "*q6[8:3]": 2401,
  "v7[8:7]": 2402,
  "*<8[1:2]": 2403,
  "*<1[1:2]": 2404,
  "*<2[1:2]": 2405,
  "*<3[1:2]": 2406,
  "*<4[1:2]": 2407,
  "*<5[1:2]": 2408,
  "p8[16:5]": 2409,
  "pp4[4:17]": 2410,
  "qq4[4:11]": 2411,
  "p4[8:13]": 2412,
  "-6[16:23]": 2413,
  "-3[16:23]": 2414,
  "*-8[16:1]": 2415,
  "<5[32:9]": 2416,
  ">1[32:9]": 2417,
  "<7[8:11]": 2418,
  "<8[2:5]": 2419,
  "*>8[8:3]": 2420,
  "qq5[2:5]": 2421,
  "z7[8:1]": 2422,
  "w4[8:7]": 2423,
  ">1[12:5]": 2424,
  "<8[12:5]": 2425,
  "*q8[16:5]": 2426,
  "p3[3:1]": 2427,
  "-8[384:47]": 2428,
  ">2[4:7]": 2429,
  "p8[8:9]": 2430,
  "*<5[16:3]": 2431,
  "<8[4:11]": 2432,
  "*q5[6:1]": 2433,
  "s8[8:3]": 2434,
  "*<5[4:1]": 2435,
  "p8[16:1]": 2436,
  "qq2[8:9]": 2437,
  "*pp1[2:1]": 2438,
  "<7[4:13]": 2439,
  "qq4[6:1]": 2440,
  "qq6[1:2]": 2441,
  "-5[384:193]": 2442,
  "-3[384:193]": 2443,
  "*<4[16:7]": 2444,
  "*<3[16:7]": 2445,
  "*<2[16:7]": 2446,
  "-3[12:5]": 2447,
  "-3[384:49]": 2448,
  "-3[384:47]": 2449,
  "-1[384:49]": 2450,
  "p6[16:1]": 2451,
  "q4[16:1]": 2452,
  ">5[16:21]": 2453,
  "<4[32:5]": 2454,
  ">2[32:5]": 2455,
  "p7[16:1]": 2456,
  "q4[12:1]": 2457,
  "w5[8:5]": 2458,
  "*qq6[8:5]": 2459,
  "qq2[16:3]": 2460,
  "p4[32:3]": 2461,
  "w4[8:5]": 2462,
  "pp3[16:1]": 2463,
  "*V82[8:1]": 2464,
  "*p6[8:1]": 2465,
  "*-5[16:1]": 2466,
  "pp6[16:7]": 2467,
  "*<7[6:1]": 2468,
  "*q3[16:3]": 2469,
  "<2[16:11]": 2470,
  ">7[16:11]": 2471,
  "q6[3:1]": 2472,
  "s6[8:1]": 2473,
  ">1[384:49]": 2474,
  "-4[384:49]": 2475,
  "v5": 2476,
  "-8": 2477,
  "-8[0.3##0.15]": 2478,
  "-1[0.3##0.15]": 2479,
  "s5[16:19]": 2480,
  "-5[0.9474##0.1579]": 2481,
  "*-3[0.9474##0.1579]": 2482,
  "-6[0.9474##0.1579]": 2483,
  "*-5[0.9474##0.1579]": 2484,
  "-8[2.2105##0.1579]": 2485,
  "*-6[2.2105##0.1579]": 2486,
  "-6[2.2105##0.1579]": 2487,
  "-3[2.2105##0.1579]": 2488,
  "-3[0.9474##0.1579]": 2489,
  "-7[0.9474##0.1579]": 2490,
  "<6[2.2105##0.1579]": 2491,
  "*>2[2.2105##0.1579]": 2492,
  "<6[0.9474##0.1579]": 2493,
  ">2[0.9474##0.1579]": 2494,
  "-2[1.5789##0.1579]": 2495,
  "*-8[1.5789##0.1579]": 2496,
  "-3[1.2632##0.1579]": 2497,
  "*-4[1.2632##0.1579]": 2498,
  "*-5[1.2632##0.1579]": 2499,
  "-3[1.5789##0.1579]": 2500,
  "-4[0.9474##0.1579]": 2501,
  "-2[1.2632##0.1579]": 2502,
  "*-8[1.2632##0.1579]": 2503,
  "*-7[1.2632##0.1579]": 2504,
  "-2[0.9474##0.1579]": 2505,
  "-8[0.6316##0.1579]": 2506,
  "*s4[0.7692##0.3846]": 2507,
  "*qq5[0.7692##0.3846]": 2508,
  "*s3[0.7692##0.3846]": 2509,
  "-3[0.7692##0.3846]": 2510,
  "*qq2[0.7692##0.3846]": 2511,
  "-5[5##0.7692]": 2512,
  "*-4[5##0.7692]": 2513,
  "*-6[5##0.7692]": 2514,
  "*-3[5##0.7692]": 2515,
