{
  "difficulty:Basic": 0,
  "SD": 1,
  "collection:Original": 2,
  "collection:SD Chart": 3,
  "collection:maimai": 4,
  "difficulty:Advanced": 5,
  "designer:譜面-100号": 6,
  "difficulty:Expert": 7,
  "designer:ニャイン": 8,
  "difficulty:Master": 9,
  "collection:POPSアニメ": 10,
  "designer:maimai TEAM": 11,
  "designer:はっぴー": 12,
  "difficulty:Re:Master": 13,
  "designer:チャン@DP皆伝": 14,
  "collection:ゲームバラエティ": 15,
  "designer:Jack": 16,
  "collection:maimai GreeN PLUS": 17,
  "collection:niconicoボーカロイド": 18,
  "collection:maimai GreeN": 19,
  "designer:舞舞10年ズ（チャンとはっぴー）": 20,
  "designer:畳返し": 21,
  "collection:maimai PLUS": 22,
  "designer:ぴちネコ": 23,
  "designer:mai-Star": 24,
  "designer:rioN": 25,
  "designer:Techno Kitchen": 26,
  "designer:すきやき奉行": 27,
  "designer:譜面-100号とはっぴー": 28,
  "designer:某S氏": 29,
  "designer:ニャインとはっぴー": 30,
  "designer:ものくロシェ": 31,
  "designer:じゃこレモン": 32,
  "designer:小鳥遊さん": 33,
  "designer:Moon Strix": 34,
  "designer:玉子豆腐": 35,
  "designer:ロシェ@ペンギン": 36,
  "designer:maimai": 37,
  "designer:合作だよ": 38,
  "designer:mai-Starとはっぴー": 39,
  "collection:東方Project": 40,
  "designer:Jack vs 某S氏": 41,
  "designer:シチミヘルツ": 42,
  "collection:maimai ORANGE": 43,
  "designer:Jack vs 譜面-100号": 44,
  "collection:maimai MURASAKi PLUS": 45,
  "designer:原田ひろゆき": 46,
  "collection:maimai ORANGE PLUS": 47,
  "designer:Revo@LC": 48,
  "designer:みんなでマイマイマー": 49,
  "designer:しろいろ": 50,
  "designer:サファ太": 51,
  "designer:隅田川星人": 52,
  "collection:maimai MURASAKi": 53,
  "collection:maimai PiNK": 54,
  "designer:華火職人": 55,
  "designer:Revo@LC vs Jack": 56,
  "designer:rioNとはっぴー": 57,
  "designer:Jack vs mai-Star": 58,
  "collection:オンゲキCHUNITHM": 59,
  "collection:maimai PiNK PLUS": 60,
  "designer:チャン@DP皆伝 vs Jack": 61,
  "designer:ぴちネコ vs Jack": 62,
  "designer:如月 ゆかり": 63,
  "designer:畳返しとはっぴー": 64,
  "designer:しろいろとはっぴー": 65,
  "collection:maimai MiLK PLUS": 66,
  "designer:緑風 犬三郎": 67,
  "collection:maimai MiLK": 68,
  "designer:LabiLabi": 69,
  "collection:maimai FiNALE": 70,
  "designer:ものくろっく": 71,
  "designer:ミストルティン": 72,
  "designer:はっぴー vs Jack": 73,
  "designer:ぴちネコ vs Moon Strix": 74,
  "designer:譜面ボーイズからの挑戦状": 75,
  "designer:Garakuta Scramble!": 76,
  "designer:“H”ack": 77,
  "designer:“H”ack underground": 78,
  "designer:“Carpe diem” ＊ HAN∀BI": 79,
  "designer:小鳥遊さん fused with Phoenix": 80,
  "designer:safaTAmago": 81,
  "designer:JAQ": 82,
  "designer:Phoenix": 83,
  "designer:-ZONE- SaFaRi": 84,
  "designer:PANDORA BOXXX": 85,
  "designer:PANDORA PARADOXXX": 86,
  "designer:小鳥遊さん vs LabiLabi": 87,
  "collection:maimai DX Splash": 88,
  "collection:maimai DX UNiVERSE": 89,
  "collection:maimai DX UNiVERSE PLUS": 90,
  "designer:ロシアンブラック": 91,
  "collection:maimai DX BUDDiES": 92,
  "designer:Luxizhel": 93,
  "collection:maimai DX FESTiVAL": 94,
  "designer:翠楼屋": 95,
  "collection:maimai DX BUDDiES PLUS": 96,
  "collection:maimai DX PRiSM PLUS": 97,
  "DX": 98,
  "collection:DX Chart": 99,
  "collection:maimai DX PLUS": 100,
  "designer:みそかつ侍": 101,
  "designer:舞舞10年ズ ～ファイナル～": 102,
  "designer:鳩ホルダー": 103,
  "collection:maimai DX": 104,
  "designer:Starlight Disco Festa": 105,
  "collection:maimai DX CiRCLE": 106,
  "designer:まぐランド": 107,
  "collection:maimai DX FESTiVAL PLUS": 108,
  "designer:うさぎランドリー": 109,
  "designer:アマリリス": 110,
  "designer:Redarrow": 111,
  "designer:佑": 112,
  "collection:maimai DX PRiSM": 113,
  "designer:ボコ太": 114,
  "designer:7.3Hz＋Jack": 115,
  "designer:シチミッピー": 116,
  "designer:Safata.Hz": 117,
  "designer:7.3GHz vs Phoenix": 118,
  "designer:jacK on Phoenix": 119,
  "designer:KTM": 120,
  "designer:群青リコリス": 121,
  "designer:いぬっくまとボコっくま": 122,
  "designer:Sukiyaki vs Happy": 123,
  "designer:7.3GHz": 124,
  "collection:maimai DX Splash PLUS": 125,
  "designer:譜面男子学院 中堅 小鳥 遊": 126,
  "designer:ゲキ*チュウマイ Fumen Team": 127,
  "designer:Anomaly Labyrinth": 128,
  "designer:七味星人": 129,
  "designer:しちみりこりす": 130,
  "designer:ﾚよ†ょ／∪ヽ”┠  (十,3､了ﾅﾆ": 131,
  "designer:サファ太 vs -ZONE- SaFaRi": 132,
  "designer:The ALiEN": 133,
  "designer:隅田川華火大会": 134,
  "designer:7.3連発華火": 135,
  "designer:The ALiEN vs. Phoenix": 136,
  "designer:アミノハバキリ": 137,
  "designer:はっぴー respects for 某S氏": 138,
  "designer:さふぁた": 139,
  "designer:小鳥遊さん vs 華火職人": 140,
  "designer:SHICHIMI☆CAT": 141,
  "designer:あまくちジンジャー": 142,
  "designer:Jack & Licorice Gunjyo": 143,
  "designer:超七味星人": 144,
  "designer:あまくちジンジャー＠やべー新人": 145,
  "designer:カマボコ君": 146,
  "designer:一ノ瀬 リズ": 147,
  "designer:-ZONE-Phoenix": 148,
  "designer:KOP3rd with 翡翠マナ": 149,
  "designer:7.3GHz -Før The Legends-": 150,
  "designer:はっぴー星人": 151,
  "designer:Jack & はっぴー vs からめる & ぐるん": 152,
  "designer:maimai Fumen All-Stars": 153,
  "designer:翡翠マナ": 154,
  "designer:チェシャ猫とハートのジャック": 155,
  "designer:小鳥遊チミ": 156,
  "designer:作譜：翠楼屋": 157,
  "designer:Hz-R.Arrow": 158,
  "designer:ネコトリサーカス団": 159,
  "designer:red phoenix": 160,
  "designer:Redarrow VS 翠楼屋": 161,
  "designer:サファ太 vs じゃこレモン": 162,
  "designer:小鳥遊さん×アミノハバキリ": 163,
  "designer:翠楼屋 vs あまくちジンジャー": 164,
  "designer:たかなっぴー": 165,
  "designer:あまくちヘルツ": 166,
  "designer:サファ太 vs 翠楼屋": 167,
  "designer:アマリリスせんせえ": 168,
  "designer:アマリリスせんせえ with ぴちネコせんせえ": 169,
  "designer:はぴネコ(はっぴー&ぴちネコ)": 170,
  "designer:チャン@DP皆伝 vs シチミヘルツ": 171,
  "designer:メロンポップ": 172,
  "designer:jacK on Phoenix & -ZONE- SaFaRi": 173,
  "designer:PG-NAKAGAWA": 174,
  "designer:Jack vs あまくちジンジャー": 175,
  "designer:翡翠マナ -Memoir-": 176,
  "designer:rintaro soma": 177,
  "designer:DANCE TIME(サファ太)": 178,
  "designer:きょむりん": 179,
  "designer:僕の檸檬本当上手": 180,
  "designer:はっぴー & サファ太": 181,
  "designer:鳩ホルダー & Luxizhel": 182,
  "designer:Safata.GHz": 183,
  "designer:鳩サファzhel": 184,
  "designer:Ruby": 185,
  "designer:ミニミライト": 186,
  "designer:みぞれヤナギ": 187,
  "designer:ずんだポップ": 188,
  "designer:りんご Full Set": 189,
  "designer:EL DiABLO": 190,
  "designer:project raputa": 191,
  "designer:maimai TEAM DX": 192,
  "designer:BEYOND THE MEMORiES": 193,
  "designer:The Dove": 194,
  "designer:LuxiHertz": 195,
  "designer:R-blacX of JacQ": 196,
  "designer:BELiZHEL": 197,
  "designer:Twinrook & Safari": 198,
  "designer:鳩ホルぴー": 199,
  "designer:Luxiいぬ": 200,
  "designer:Luxizhel & Jack": 201,
  "designer:サファ太 & ぴちネコ": 202,
  "designer:みぞれヤナギ & サファ太": 203,
  "designer:サファ太 Vs. Safari Vs. さふぁた": 204,
  "designer:Jack vs サファ太": 205,
  "designer:Jack&アマリリス": 206,
  "designer:Safazhel": 207,
  "designer:みぞれヤナギ & Jack": 208,
  "designer:BELiZHEL vs 7.3GHz": 209,
  "designer:BLaCK rOSE dIsEASe pATiENT": 210,
  "designer:サファ太 vs Luxizhel": 211,
  "designer:BELiZHEL vs Safari": 212,
  "designer:サファ太 & 鳩ホルダー": 213,
  "designer:ロシェ＠ペンギン と はっぴー": 214,
  "designer:メロンポップ vs Luxizhel": 215,
  "designer:サファ太 respects for 小鳥遊さん": 216,
  "designer:SAFARi☆CAT": 217,
  "designer:SΛFΛRI/RΦCHER": 218,
  "designer:きょむりん vs Luxizhel": 219,
  "designer:7sRef -DOVE-": 220,
  "designer:KALEIDXSCOPE": 221,
  "designer:Xaleid◆scopiX": 222,
  "designer:きょむりん ＆ Luxizhel": 223,
  "designer:Jack + Soma": 224,
  "designer:サぴぴぴぴちネファ太太太太コ": 225,
  "designer:Luxizhel & はっぴー": 226,
  "designer:サファ太 Vs. Safari Vs. Saf Vs. モリモリさふぁた": 227,
  "designer:カマボコホルダー": 228,
  "designer:三枝明那とはっぴー": 229,
  "designer:Luxizhel & 鳩ホルダー": 230,
  "designer:Luxizhel vs サファ太": 231,
  "designer:星期日": 232,
  "difficulty:UTAGE": 233,
  "collection:宴会場": 234
}