{
  "tap27": 1,
  "tap18": 2,
  "tap36": 3,
  "tap45": 4,
  "hold3": 5,
  "hold6": 6,
  "tap2": 7,
  "tap1": 8,
  "hold8": 9,
  "hold7": 10,
  "tap6": 11,
  "tap5": 12,
  "slide6": 13,
  "slide2": 14,
  "hold2": 15,
  "tap3": 16,
  "tap4": 17,
  "slide3": 18,
  "slide7": 19,
  "hold1": 20,
  "hold4": 21,
  "hold1+hold7": 22,
  "hold2+hold8": 23,
  "hold4+hold6": 24,
  "hold3+hold5": 25,
  "tap8": 26,
  "tap7": 27,
  "hold3+hold6": 28,
  "touchE": 29,
  "tap78": 30,
  "tap1+hold2": 31,
  "hold2+hold7": 32,
  "hold1+hold8": 33,
  "hold5": 34,
  "tap1+slide8": 35,
  "slide1": 36,
  "slide8": 37,
  "hold2+hold6": 38,
  "slide4": 39,
  "slide4+slide8": 40,
  "tap37": 41,
  "hold3+hold7": 42,
  "tap13": 43,
  "tap14": 44,
  "slide5": 45,
  "tap17": 46,
  "tap68": 47,
  "tap56": 48,
  "tap47": 49,
  "tap34": 50,
  "tap25": 51,
  "tap38": 52,
  "tap16": 53,
  "tap28": 54,
  "tap24": 55,
  "tap35": 56,
  "tap57": 57,
  "tap8+slide4": 58,
  "tap26": 59,
  "tap12": 60,
  "tap46": 61,
  "tap6+slide3": 62,
  "tap4+tap7": 63,
  "tap6+tap7": 64,
  "tap6+hold4": 65,
  "slide1+slide8": 66,
  "tap4+hold8": 67,
  "tap15": 68,
  "tap6+slide8": 69,
  "tap1+slide7": 70,
  "hold1+slide8": 71,
  "tap3+slide5": 72,
  "tap7+slide1": 73,
  "tap6+slide4": 74,
  "tap2+slide8": 75,
  "tap1+tap6": 76,
  "tap1+tap8": 77,
  "tap7+hold2": 78,
  "tap6+tap37": 79,
  "slide4+slide5": 80,
  "tap2+hold7": 81,
  "tap7+slide8": 82,
  "tap3+slide2": 83,
  "tap2+slide1": 84,
  "tap6+slide7": 85,
  "tap48": 86,
  "tap6+hold5": 87,
  "tap2+hold1": 88,
  "tap23": 89,
  "tap67": 90,
  "hold1+hold6": 91,
  "hold3+hold8": 92,
  "hold1+hold3": 93,
  "hold7+hold8": 94,
  "hold1+hold2": 95,
  "tap58": 96,
  "tap1+hold3": 97,
  "hold4+hold7": 98,
  "tap1+hold8": 99,
  "tap5+hold4": 100,
  "tap2+slide7": 101,
  "tap5+slide1": 102,
  "tap4+slide8": 103,
  "slide1+slide2": 104,
  "tap2+hold3": 105,
  "tap7+hold6": 106,
  "tap2+hold8": 107,
  "tap7+hold1": 108,
  "tap4+slide3": 109,
  "tap8+hold2": 110,
  "tap1+hold7": 111,
  "tap6+slide5": 112,
  "tap2+slide3": 113,
  "tap6+hold1": 114,
  "slide7+slide8": 115,
  "tap8+hold1": 116,
  "tap5+slide3": 117,
  "tap5+slide7": 118,
  "tap4+slide6": 119,
  "tap4+slide2": 120,
  "slide3+slide7": 121,
  "slide1+slide5": 122,
  "slide2+slide6": 123,
  "tap8+slide1": 124,
  "tap1+slide2": 125,
  "tap8+slide7": 126,
  "tap1+slide5": 127,
  "tap7+slide2": 128,
  "tap8+slide2": 129,
  "tap4+slide5": 130,
  "tap5+slide4": 131,
  "tap8+slide5": 132,
  "tap4+slide1": 133,
  "tap1+slide4": 134,
  "tap5+slide8": 135,
  "tap3+slide4": 136,
  "hold4+hold5": 137,
  "slide6+slide7": 138,
  "tap6+hold2": 139,
  "tap6+hold3": 140,
  "tap5+hold1": 141,
  "tap4+hold5": 142,
  "tap8+hold7": 143,
  "tap8+hold6": 144,
  "slide5+slide6": 145,
  "tap3+slide1": 146,
  "tap3+slide6": 147,
  "tap3+slide7": 148,
  "tap6+slide1": 149,
  "tap6+slide2": 150,
  "hold3+slide2": 151,
  "slide3+slide5": 152,
  "slide4+slide6": 153,
  "slide2+slide8": 154,
  "tap2+slide5": 155,
  "tap2+hold5": 156,
  "hold2+hold4": 157,
  "hold5+hold7": 158,
  "slide2+slide3": 159,
  "hold2+hold5": 160,
  "hold1+hold5": 161,
  "hold4+hold8": 162,
  "hold6+hold8": 163,
  "hold1+slide5": 164,
  "hold5+slide1": 165,
  "tap3+slide8": 166,
  "slide2+slide7": 167,
  "slide3+slide6": 168,
  "tap4+tap5": 169,
  "tap3+tap8": 170,
  "tap4+tap6": 171,
  "tap5+tap6": 172,
  "tap2+tap4": 173,
  "tap4+tap18": 174,
  "tap4+hold2": 175,
  "tap2+tap7": 176,
  "tap6+tap18": 177,
  "tap2+tap18": 178,
  "tap3+tap5": 179,
  "tap5+tap28": 180,
  "tap8+tap13+hold7": 181,
  "tap5+hold2": 182,
  "tap5+hold7": 183,
  "hold5+hold6": 184,
  "tap7+hold4": 185,
  "tap5+hold3": 186,
  "tap5+tap5+tap6+tap7": 187,
  "tap2+tap3+tap4": 188,
  "tap2+tap3": 189,
  "tap5+hold5": 190,
  "tap5+tap7": 191,
  "tap4+hold4": 192,
  "tap57+slide5": 193,
  "tap1+slide1": 194,
  "tap4+slide4": 195,
  "tap2+tap6": 196,
  "tap6+tap57": 197,
  "tap5+tap57": 198,
  "tap24+tap24": 199,
  "tap4+tap34": 200,
  "tap3+tap24": 201,
  "tap13+tap57": 202,
  "tap15+tap37": 203,
  "tap3+hold5": 204,
  "tap24+tap68": 205,
  "hold4+slide5": 206,
  "tap1+tap46": 207,
  "tap8+tap18": 208,
  "tap5+hold6": 209,
  "tap3+hold6": 210,
  "hold3+hold4": 211,
  "slide3+slide4": 212,
  "tap4+hold6": 213,
  "tap1+hold6": 214,
  "tap8+hold3": 215,
  "tap2+slide4": 216,
  "hold6+slide2": 217,
  "tap3+tap7": 218,
  "tap7+hold8": 219,
  "tap1+tap5": 220,
  "tap3+hold4": 221,
  "tap3+hold7": 222,
  "tap1+hold4": 223,
  "tap34+tap56": 224,
  "tap3+hold2": 225,
  "tap3+tap27": 226,
  "tap6+hold7": 227,
  "tap8+slide3": 228,
  "tap1+slide6": 229,
  "slide3+slide8": 230,
  "slide1+slide6": 231,
  "tap6+tap8": 232,
  "tap2+tap8": 233,
  "tap2+tap7+hold6": 234,
  "tap5+slide6": 235,
  "tap3+hold8": 236,
  "tap5+hold8": 237,
  "tap4+hold1": 238,
  "tap6+hold8": 239,
  "tap3+hold1": 240,
  "tap5+tap8": 241,
  "tap4+hold3": 242,
  "tap8+tap8": 243,
  "tap1+tap2": 244,
  "tap7+tap27": 245,
  "tap4+tap45": 246,
  "tap2+hold2": 247,
  "tap1+tap7": 248,
  "tap8+tap27": 249,
  "tap3+tap16": 250,
  "tap4+tap8": 251,
  "tap3+tap18": 252,
  "tap6+tap45": 253,
  "tap8+tap45": 254,
  "tap3+tap37": 255,
  "tap2+slide1+slide5": 256,
  "tap18+tap47": 257,
  "tap3+tap25": 258,
  "tap1+tap28": 259,
  "tap3+tap6": 260,
  "tap2+tap5": 261,
  "tap1+hold5": 262,
  "tap7+tap47": 263,
  "tap6+tap28": 264,
  "tap4+slide7": 265,
  "tap7+hold5": 266,
  "tap2+hold4": 267,
  "tap1+tap3": 268,
  "tap8+hold5": 269,
  "tap3+tap45": 270,
  "tap4+tap4": 271,
  "tap57+hold5": 272,
  "hold3+slide8": 273,
  "hold7+slide2": 274,
  "tap7+slide6": 275,
  "tap4+hold7": 276,
  "tap8+hold4": 277,
  "tap1+slide3": 278,
  "tap2+slide6": 279,
  "tap7+slide3": 280,
  "slide1+slide7": 281,
  "tap7+tap8": 282,
  "tap7+slide4": 283,
  "tap8+slide6": 284,
  "tap7+slide5": 285,
  "tap1+tap8+slide2": 286,
  "hold1+slide2": 287,
  "hold7+slide6": 288,
  "hold4+slide3": 289,
  "hold8+slide5": 290,
  "tap5+slide2": 291,
  "tap2+tap3+slide4": 292,
  "hold8+slide2": 293,
  "hold2+slide7": 294,
  "hold1+slide3": 295,
  "hold5+slide2": 296,
  "hold7+slide1": 297,
  "hold2+slide8": 298,
  "hold2+slide3": 299,
  "slide5+slide7": 300,
  "slide1+slide3": 301,
  "tap2+hold6": 302,
  "tap7+hold3": 303,
  "hold2+hold3": 304,
  "hold5+hold8": 305,
  "hold7+slide8": 306,
  "hold2+slide1": 307,
  "hold5+slide6": 308,
  "hold6+slide5": 309,
  "hold3+slide4": 310,
  "slide4+slide7": 311,
  "slide2+slide5": 312,
  "slide5+slide8": 313,
  "slide1+slide4": 314,
  "hold4+slide7": 315,
  "hold6+hold7": 316,
  "tap5+tap78": 317,
  "tap2+tap45": 318,
  "tap1+tap4": 319,
  "tap17+tap28": 320,
  "tap7+tap7": 321,
  "tap6+hold6": 322,
  "tap3+tap4": 323,
  "tap3+tap3": 324,
  "tap1+tap1": 325,
  "tap6+tap6": 326,
  "tap8+slide8": 327,
  "tap18+tap27": 328,
  "tap4+tap78": 329,
  "tap3+slide3": 330,
  "tap1+hold1": 331,
  "tap17+tap18": 332,
  "tap3+slide5+slide6": 333,
  "hold8+slide6": 334,
  "hold1+slide4": 335,
  "hold6+slide7": 336,
  "hold5+slide4": 337,
  "hold4+slide8": 338,
  "hold6+slide8": 339,
  "hold4+slide2": 340,
  "slide6+slide8": 341,
  "hold6+slide3": 342,
  "hold5+slide3": 343,
  "hold3+slide6": 344,
  "hold4+slide6": 345,
  "hold1+hold4": 346,
  "hold8+slide7": 347,
  "hold7+slide3": 348,
  "tap12+tap18": 349,
  "tap7+tap18": 350,
  "tap2+tap2": 351,
  "tap1+tap58": 352,
  "tap5+tap5": 353,
  "tap2+tap14": 354,
  "tap36+tap36": 355,
  "tap45+slide3": 356,
  "tap8+hold1+slide8": 357,
  "hold8+slide1": 358,
  "hold1+slide6": 359,
  "tap1+tap78": 360,
  "tap1+tap26": 361,
  "tap1+tap27+slide8": 362,
  "tap4+tap12": 363,
  "hold5+slide8": 364,
  "hold2+slide6": 365,
  "tap5+tap8+hold7": 366,
  "hold3+slide1": 367,
  "slide2+slide4": 368,
  "hold3+slide7": 369,
  "tap26+tap37": 370,
  "hold8+slide3": 371,
  "hold6+slide4": 372,
  "hold7+slide4": 373,
  "hold8+slide4": 374,
  "hold2+slide4": 375,
  "tap8+tap78": 376,
  "hold5+slide7": 377,
  "hold6+slide1": 378,
  "hold1+slide7": 379,
  "tap7+tap48": 380,
  "tap36+tap45": 381,
  "tap7+tap15+tap68": 382,
  "tap8+tap15": 383,
  "tap2+slide2": 384,
  "tap7+slide7": 385,
  "tap6+tap8+slide3": 386,
  "tap2+tap7+slide7": 387,
  "tap2+tap16": 388,
  "tap2+hold8+slide1": 389,
  "hold2+slide8+slide8": 390,
  "slide7+slide7": 391,
  "tap3+tap6+tap7": 392,
  "tap6+tap34": 393,
  "tap6+tap12": 394,
  "tap7+slide3+slide7": 395,
  "tap26+slide1+slide5": 396,
  "tap26+slide8": 397,
  "tap37+slide2": 398,
  "tap1+tap2+tap2": 399,
  "tap5+tap18": 400,
  "tap13+tap45": 401,
  "tap18+tap36": 402,
  "tap24+hold4": 403,
  "tap5+tap38": 404,
  "tap6+tap27": 405,
  "tap5+tap23": 406,
  "tap8+tap23": 407,
  "tap7+tap16+slide3": 408,
  "tap34+tap47": 409,
  "tap25+tap56": 410,
  "tap47+tap56": 411,
  "tap8+tap12": 412,
  "hold7+slide5": 413,
  "tap5+tap56": 414,
  "hold4+slide1": 415,
  "tap4+tap8+hold5": 416,
  "tap36+tap57": 417,
  "tap35+tap46": 418,
  "tap1+tap48": 419,
  "tap8+tap37": 420,
  "tap8+tap67": 421,
  "tap48+hold3+hold7": 422,
  "tap12+tap38": 423,
  "tap68+slide1": 424,
  "tap7+hold7": 425,
  "tap6+tap36": 426,
  "tap3+slide1+slide5": 427,
  "tap26+slide3+slide7": 428,
  "tap6+tap25": 429,
  "tap26+slide5+slide6": 430,
  "tap34+tap37": 431,
  "tap47+tap78": 432,
  "tap3+tap47": 433,
  "tap3+slide2+slide7": 434,
  "tap7+tap46": 435,
  "tap3+tap27+slide4": 436,
  "tap12+tap56": 437,
  "tap38+tap47": 438,
  "tap25+tap47": 439,
  "tap1+tap38": 440,
  "tap16+tap78": 441,
  "tap7+tap38": 442,
  "slide1+slide2+slide3+slide4": 443,
  "slide5+slide6+slide7+slide8": 444,
  "tap4+tap5+slide2": 445,
  "tap78+slide3": 446,
  "tap25+slide7": 447,
  "tap18+tap25": 448,
  "tap5+tap25": 449,
  "tap8+tap46": 450,
  "tap8+tap36": 451,
  "tap27+tap56": 452,
  "tap4+tap67": 453,
  "tap1+tap5+tap8": 454,
  "tap2+tap3+tap6": 455,
  "hold3+slide5": 456,
  "tap5+tap48": 457,
  "tap7+tap18+hold6": 458,
  "tap36+slide2+slide7": 459,
  "tap4+tap5+tap6": 460,
  "tap1+tap2+tap3": 461,
  "tap5+tap6+tap7": 462,
  "tap45+slide3+slide7": 463,
  "tap2+tap5+hold4": 464,
  "tap1+tap8+slide5": 465,
  "tap14+tap25": 466,
  "tap25+tap36": 467,
  "tap3+slide2+slide6": 468,
  "tap37+tap48": 469,
  "tap6+tap7+hold1": 470,
  "tap27+hold8": 471,
  "tap5+tap45": 472,
  "tap27+hold5": 473,
  "tap38+tap38": 474,
  "tap47+tap47": 475,
  "tap5+tap17+slide2": 476,
  "tap4+tap16": 477,
  "tap5+tap35": 478,
  "hold3+slide3": 479,
  "tap3+tap5+hold6": 480,
  "tap5+tap36": 481,
  "tap1+tap57": 482,
  "tap1+tap4+hold5": 483,
  "tap78+slide7": 484,
  "tap1+tap37": 485,
  "tap2+tap48": 486,
  "tap1+tap2+tap48": 487,
  "tap15+tap48": 488,
  "tap4+tap35": 489,
  "hold2+slide5": 490,
  "tap8+hold2+hold7": 491,
  "tap5+tap34": 492,
  "tap4+tap46": 493,
  "tap7+tap35": 494,
  "tap7+tap24": 495,
  "tap56+slide8": 496,
  "tap4+tap56": 497,
  "tap3+tap34": 498,
  "tap45+tap47": 499,
  "tap27+tap34": 500,
  "tap7+tap28": 501,
  "tap3+tap68": 502,
  "tap3+tap8+slide1": 503,
  "tap2+tap2+slide8": 504,
  "tap6+tap13": 505,
  "tap1+tap18": 506,
  "tap8+tap27+slide7": 507,
  "tap1+tap3+slide8": 508,
  "tap4+tap7+slide8": 509,
  "tap7+tap8+slide4": 510,
  "tap2+tap27+slide7": 511,
  "tap16+tap47": 512,
  "tap25+slide2": 513,
  "tap1+slide1+slide2": 514,
  "tap34+tap78": 515,
  "tap34+tap45": 516,
  "tap13+tap47": 517,
  "tap7+tap34": 518,
  "tap2+tap25": 519,
  "tap1+tap47": 520,
  "tap6+hold1+hold5": 521,
  "tap27+tap36": 522,
  "tap8+tap38": 523,
  "tap7+tap13": 524,
  "tap5+tap27": 525,
  "tap5+tap47": 526,
  "tap24+tap78": 527,
  "tap27+hold3+slide8": 528,
  "tap56+hold7+slide4": 529,
  "tap18+hold6+slide4": 530,
  "tap5+tap17": 531,
  "tap18+tap57": 532,
  "tap26+slide7": 533,
  "tap2+tap26": 534,
  "tap2+tap38": 535,
  "tap1+tap17": 536,
  "tap4+tap47": 537,
  "tap6+tap46": 538,
  "tap46+tap57": 539,
  "tap36+tap48": 540,
  "tap27+tap27": 541,
  "tap5+tap34+hold2": 542,
  "tap4+tap4+hold3": 543,
  "tap7+tap7+hold6": 544,
  "tap3+tap36": 545,
  "tap36+tap56": 546,
  "tap12+tap16": 547,
  "tap4+tap25+slide7": 548,
  "tap16+tap45": 549,
  "tap1+tap16+slide6": 550,
  "tap8+slide1+slide5": 551,
  "tap3+tap6+hold8": 552,
  "tap37+tap46": 553,
  "tap15+tap26": 554,
  "tap1+tap24": 555,
  "tap26+tap35": 556,
  "tap46+slide5": 557,
  "tap27+slide1+slide8": 558,
  "tap4+tap27": 559,
  "tap3+tap48": 560,
  "tap12+tap78": 561,
  "tap4+slide4+slide5": 562,
  "tap3+tap5+hold2": 563,
  "tap45+tap46": 564,
  "tap28+tap37+tap46": 565,
  "hold3+hold4+hold5+hold6": 566,
  "tap1+tap56+slide3": 567,
  "tap8+tap56": 568,
  "tap12+tap34": 569,
  "tap5+hold2+hold7": 570,
  "tap5+slide3+slide6": 571,
  "tap4+slide3+slide7": 572,
  "tap1+tap8+hold5": 573,
  "tap45+hold7": 574,
  "tap6+slide6": 575,
  "tap18+tap24": 576,
  "tap6+tap8+slide7": 577,
  "tap4+tap26": 578,
  "tap3+tap4+slide8": 579,
  "tap4+tap8+slide1": 580,
  "tap3+tap12": 581,
  "tap6+tap78": 582,
  "tap4+tap23": 583,
  "tap1+tap23": 584,
  "tap5+tap67": 585,
  "tap5+tap24": 586,
  "tap4+tap57": 587,
  "tap4+tap5+slide3": 588,
  "tap67+hold3+hold4": 589,
  "tap8+slide1+slide7": 590,
  "tap7+slide3+slide8": 591,
  "tap6+tap8+slide1": 592,
  "tap8+tap35": 593,
  "tap7+tap8+hold5": 594,
  "tap17+tap56": 595,
  "tap28+slide4+slide8": 596,
  "tap2+hold4+hold5+slide1": 597,
  "tap12+hold3": 598,
  "tap1+tap7+tap8": 599,
  "tap6+tap7+tap8+hold2": 600,
  "tap45+tap45": 601,
  "tap2+tap15": 602,
  "tap7+tap8+hold1": 603,
  "tap2+tap3+hold1": 604,
  "tap18+hold2": 605,
  "tap47+hold2+hold5": 606,
  "tap7+tap15": 607,
  "tap4+tap58": 608,
  "tap7+slide6+slide8": 609,
  "tap8+tap17+slide1": 610,
  "tap13+tap18": 611,
  "tap7+tap57": 612,
  "tap4+tap48": 613,
  "tap4+tap4+slide5": 614,
  "tap7+tap8+slide2": 615,
  "tap8+tap24": 616,
  "tap5+tap48+slide1": 617,
  "tap2+tap47": 618,
  "tap15+tap18": 619,
  "tap6+tap8+hold7": 620,
  "tap1+tap2+tap8": 621,
  "tap2+tap6+hold7": 622,
  "tap1+tap2+slide8": 623,
  "tap14+hold4": 624,
  "tap2+tap8+slide1": 625,
  "tap5+slide5": 626,
  "tap7+tap37": 627,
  "tap27+tap45": 628,
  "tap2+tap27": 629,
  "tap7+tap25": 630,
  "tap2+tap56": 631,
  "tap46+tap47": 632,
  "tap4+tap6+slide4": 633,
  "tap2+slide3+slide7": 634,
  "tap7+tap26": 635,
  "tap5+tap8+hold1": 636,
  "tap8+hold5+slide1": 637,
  "tap4+tap37+slide8": 638,
  "tap3+tap4+tap7": 639,
  "tap2+tap36": 640,
  "tap1+tap5+slide8": 641,
  "tap8+slide1+slide6": 642,
  "tap1+tap8+hold4": 643,
  "tap6+tap7+hold2": 644,
  "tap5+tap8+slide1": 645,
  "tap6+tap15": 646,
  "tap4+tap28": 647,
  "tap28+tap37": 648,
  "tap5+tap46": 649,
  "tap1+tap25": 650,
  "tap7+tap37+slide8": 651,
  "tap27+tap38": 652,
  "tap16+tap27": 653,
  "tap1+hold4+slide8": 654,
  "tap2+tap34": 655,
  "tap3+tap57": 656,
  "tap5+tap45+slide3": 657,
  "tap4+tap6+slide6": 658,
  "tap3+tap35": 659,
  "tap18+tap45": 660,
  "tap3+slide4+slide5": 661,
  "tap45+hold4": 662,
  "tap5+tap8+slide3": 663,
  "tap4+tap7+slide6": 664,
  "tap3+tap4+slide3": 665,
  "tap6+tap56": 666,
  "tap1+tap4+slide8": 667,
  "tap25+tap34": 668,
  "tap5+tap6+hold2": 669,
  "tap5+tap25+hold6": 670,
  "tap8+tap16": 671,
  "tap6+tap7+slide5": 672,
  "tap45+hold6": 673,
  "tap4+tap18+slide8": 674,
  "tap2+tap35": 675,
  "tap5+tap25+slide2": 676,
  "tap2+tap4+hold8": 677,
  "tap3+tap46": 678,
  "tap2+slide1+slide8": 679,
  "tap6+tap17": 680,
  "tap1+tap2+tap8+slide4+slide7": 681,
  "tap7+tap8+tap15": 682,
  "tap4+tap36": 683,
  "tap5+tap16": 684,
  "tap3+tap45+slide6": 685,
  "tap3+tap17+tap26+slide5": 686,
  "tap3+tap4+tap5+hold7": 687,
  "tap2+tap6+hold3": 688,
  "tap4+tap8+hold7": 689,
  "tap1+tap4+tap8+hold7": 690,
  "tap4+tap7+tap8": 691,
  "tap6+tap7+tap8": 692,
  "tap1+tap2+tap5+tap36": 693,
  "tap5+tap6+tap7+hold2": 694,
  "tap3+tap7+hold6": 695,
  "tap1+tap5+hold2": 696,
  "tap3+tap7+tap8+hold6": 697,
  "tap1+tap2+tap5+tap8": 698,
  "tap7+tap15+tap26": 699,
  "tap1+tap2+hold5": 700,
  "tap3+tap4+tap5": 701,
  "tap1+tap2+tap3+tap6+tap7+tap8+hold5": 702,
  "tap7+tap8+hold1+hold5": 703,
  "tap6+tap7+hold3": 704,
  "tap5+tap6+tap7+hold3": 705,
  "tap1+tap8+hold3+hold7": 706,
  "tap48+slide1+slide5": 707,
  "tap7+tap16": 708,
  "tap4+tap6+slide2": 709,
  "tap2+tap3+slide7": 710,
  "tap7+tap36+slide2": 711,
  "tap16+tap25": 712,
  "tap1+tap25+hold7+hold8+slide6": 713,
  "tap57+hold6": 714,
  "tap2+tap3+tap15": 715,
  "tap1+tap2+tap37": 716,
  "tap3+tap4+tap15": 717,
  "tap7+tap8+hold4": 718,
  "tap1+tap2+tap7+tap8+hold4": 719,
  "tap2+tap3+tap4+tap5+hold7": 720,
  "tap1+tap7+tap8+hold4": 721,
  "tap4+tap5+tap5": 722,
  "tap4+tap5+slide5": 723,
  "tap2+tap4+hold6": 724,
  "tap6+hold4+hold7": 725,
  "tap36+hold5+hold6": 726,
  "tap5+tap26": 727,
  "tap5+tap7+slide1": 728,
  "tap3+tap3+slide7": 729,
  "tap2+tap6+slide7": 730,
  "tap2+tap6+slide3": 731,
  "tap8+tap8+slide4": 732,
  "tap3+tap8+slide6": 733,
  "tap1+tap27": 734,
  "tap1+tap6+slide8": 735,
  "tap1+tap6+tap7": 736,
  "tap5+tap26+slide1": 737,
  "tap7+hold4+hold8": 738,
  "tap47+tap58": 739,
  "tap7+slide1+slide8": 740,
  "tap27+slide2+slide7": 741,
  "tap4+tap6+hold2": 742,
  "tap3+tap6+slide2": 743,
  "tap67+slide5+slide8": 744,
  "tap14+tap23": 745,
  "tap12+hold5+slide3": 746,
  "tap1+tap2+tap7": 747,
  "tap3+tap4+slide4+slide8": 748,
  "tap26+tap45": 749,
  "tap15+hold2+hold6": 750,
  "tap36+hold4+hold5": 751,
  "tap36+slide4+slide5": 752,
  "tap3+tap4+hold2": 753,
  "tap7+tap56": 754,
  "tap2+tap12": 755,
  "tap1+tap56": 756,
  "tap2+hold8+slide7": 757,
  "tap34+tap48": 758,
  "tap12+tap27": 759,
  "tap2+tap67": 760,
  "tap3+tap58": 761,
  "tap4+tap4+tap5": 762,
  "tap3+tap3+tap5": 763,
  "slide1+slide4+slide5+slide8": 764,
  "tap4+tap8+slide4": 765,
  "tap3+tap4+slide7": 766,
  "tap1+tap1+tap8": 767,
  "tap1+tap1+tap8+tap8": 768,
  "touchB6": 769,
  "touchB7": 770,
  "touchB8": 771,
  "touchB1": 772,
  "touchB2": 773,
  "touchB3": 774,
  "touchB4B5": 775,
  "touchB3B6": 776,
  "touchB2B7": 777,
  "holdC1": 778,
  "touchE3": 779,
  "touchB4": 780,
  "touchE7": 781,
  "touchB5": 782,
  "touchC1": 783,
  "touchE1": 784,
  "touchE5": 785,
  "touchE2E7": 786,
  "touchE3E8": 787,
  "touchB3B6C1": 788,
  "touchB4B8C1": 789,
  "touchB2B7C1": 790,
  "touchE8": 791,
  "touchE2": 792,
  "tap37+slide2+slide6": 793,
  "touchE3E7": 794,
  "touchB2B6": 795,
  "touchB1B5+touchC1": 796,
  "touchE1E5": 797,
  "touchB1B8": 798,
  "touchB5B6": 799,
  "touchB3B4": 800,
  "touchA3A7B3B7D3D8E3E8": 801,
  "touchA3B3E3": 802,
  "touchB4B5E5": 803,
  "touchA6B6E7": 804,
  "touchA5A7B5B7": 805,
  "touchA3A4A5D4D5": 806,
  "touchB5B6C1E6": 807,
  "touchA3A4A7A8E4E8": 808,
  "touchA1A2A5A6E2E6": 809,
  "tap1+touchC1": 810,
  "slide1+touchB6+touchB7+touchE7": 811,
  "slide1+touchB2+touchB3+touchE3": 812,
  "tap8+touchB3+touchB4+touchB5+touchC1": 813,
  "tap3+touchB6+touchB7+touchB8+touchC1": 814,
  "touchE6": 815,
  "touchE3E5": 816,
  "touchE4": 817,
  "touchA6E7": 818,
  "touchA3E3": 819,
  "touchB2E3": 820,
  "touchB4B7E5E7": 821,
  "touchB2E2": 822,
  "touchB7E8": 823,
  "touchB4B5C1": 824,
  "touchA4A8B4B8": 825,
  "touchB3B4B5B6C1E4E6": 826,
  "tap6+tap12+hold5": 827,
  "tap8+tap34": 828,
  "touchB1B2B3B4B5B6B7B8C1D1E1E4E6": 829,
  "touchA8B8D1E1+touchE8": 830,
  "touchA1B1D2E2": 831,
  "touchA2B2D3E3+touchA3B3D4E4": 832,
  "touchA7B7D8E8+touchE7": 833,
  "touchA8B8D1E1": 834,
  "touchA1B1D2E2+touchA2B2D3E3": 835,
  "touchA6B6D7E7+touchE6": 836,
  "touchA7B7D8E8": 837,
  "touchA1B1D2E2+touchA8B8D1E1": 838,
  "touchA3A4A5A6B3B4B5B6": 839,
  "touchA5B5D5D6E5E6": 840,
  "touchA4B4D4D5E4E5": 841,
  "tap2+tap8+slide8": 842,
  "touchA8B8D1D8E1E8": 843,
  "touchA1B1D1D2E1E2": 844,
  "touchA3B3D3D4E3E4": 845,
  "touchA6B6D6D7E6E7": 846,
  "touchA1A6+touchD1D7": 847,
  "touchD2D6": 848,
  "touchA2A5": 849,
  "touchB1B6+touchE1E7": 850,
  "tap15+touchB2B5": 851,
  "touchA3A8+touchD1D3": 852,
  "tap26+touchD4D8": 853,
  "touchA4A7": 854,
  "touchB3B8+touchE1E3": 855,
  "tap37+touchB4B7": 856,
  "touchE5E7": 857,
  "tap4+tap15": 858,
  "tap5+tap6+touchC1": 859,
  "tap5+tap6+tap14": 860,
  "tap4+tap5+slide1+slide8": 861,
  "tap5+tap14+slide8": 862,
  "tap5+tap6+tap6": 863,
  "tap3+tap3+tap4+tap4+tap5": 864,
  "touchA1+touchA2": 865,
  "touchA3": 866,
  "touchA4+touchA5+touchA6": 867,
  "touchA7": 868,
  "touchA8+touchB1+touchB2": 869,
  "touchB4+touchB5+touchB6": 870,
  "touchB1+touchB8": 871,
  "touchB1B2B3B4B5B6B7B8C1E1E2E3E4E5E6E7E8": 872,
  "tap48+touchD4D8": 873,
  "hold7+touchD3D7": 874,
  "touchD3": 875,
  "touchA2A3D2D4E3": 876,
  "tap1+touchD7": 877,
  "touchA6A7D6D8E7": 878,
  "touchA3A4A5A6B3B4B5B6C1D4D5D6E4E5E6": 879,
  "tap2+touchE3": 880,
  "tap7+touchE4": 881,
  "touchE3+touchE6": 882,
  "tap4+touchE2": 883,
  "tap7+touchE8": 884,
  "tap5+touchE6": 885,
  "tap3+touchE4": 886,
  "tap3+touchE5": 887,
  "tap6+slide8+touchC1": 888,
  "touchB7B8": 889,
  "touchB1B2": 890,
  "touchE2E8": 891,
  "touchB3B4B5B6": 892,
  "touchA2": 893,
  "touchA4": 894,
  "touchA8": 895,
  "touchA6": 896,
  "touchA5": 897,
  "touchB1+touchC1": 898,
  "tap1+touchE7": 899,
  "tap2+touchE8": 900,
  "tap3+touchE1": 901,
  "tap8+touchE3": 902,
  "tap7+touchE2": 903,
  "tap6+touchE1": 904,
  "tap5+touchE8": 905,
  "tap56+tap56": 906,
  "touchB2B3B6B7C1": 907,
  "tap2+touchB6+touchE6": 908,
  "tap8+touchB4+touchB5+touchC1": 909,
  "hold5+touchE8": 910,
  "hold4+touchE7": 911,
  "hold3+touchE6": 912,
  "hold2+touchE5": 913,
  "tap1+touchB5": 914,
  "tap2+touchB6": 915,
  "tap3+touchB7": 916,
  "tap4+touchB8": 917,
  "tap5+touchB1": 918,
  "tap6+touchB2": 919,
  "tap7+touchB3": 920,
  "tap8+touchB4": 921,
  "hold7+touchE5": 922,
  "hold6+touchE4": 923,
  "hold5+touchE3": 924,
  "hold4+touchE2": 925,
  "touchA3A7E4E8": 926,
  "touchB2B6E2E6": 927,
  "touchA4A7B4B7": 928,
  "touchA2A5B2B5": 929,
  "touchA3A7B3B7E4E8": 930,
  "touchA1A5B2B6E2E6": 931,
  "touchA4A8B4B8E1E5": 932,
  "holdC1+touchB2+touchB6+touchE2+touchE3+touchE6+touchE7": 933,
  "touchA4A5D5": 934,
  "touchE3E7+touchE4E6": 935,
  "touchB4B5E4E6": 936,
  "touchB1B2B7B8C1": 937,
  "touchB3B4B5B6C1": 938,
  "touchA1": 939,
  "touchB1B2B7B8E1": 940,
  "touchA1D1D2": 941,
  "touchA4D4D5": 942,
  "touchA8D1D8": 943,
  "touchA6B6": 944,
  "touchA8B8": 945,
  "touchB5D5E5": 946,
  "touchA3B3": 947,
  "touchA1B1": 948,
  "touchB4D5E5": 949,
  "touchB1B2B3B4C1E1E2E3E4E5": 950,
  "touchB5B6B7B8E1E5E6E7E8": 951,
  "touchB1B2B3B4E2E3E4E5": 952,
  "touchB5B6B7B8E6E7E8": 953,
  "touchB2B3B4E3E4E5": 954,
  "touchB7B8E1E7E8": 955,
  "touchB4B5E5E6": 956,
  "touchB2E2E3": 957,
  "touchE6E7": 958,
  "hold6+touchC1": 959,
  "hold5+touchC1": 960,
  "hold4+touchC1": 961,
  "hold3+touchC1": 962,
  "hold2+touchC1": 963,
  "touchB1B2B3B4B5B6B7B8": 964,
  "tap2+touchC1": 965,
  "touchE1E2": 966,
  "touchB3E4": 967,
  "touchE4E6": 968,
  "touchE1E8": 969,
  "touchB5E6": 970,
  "touchB6B7": 971,
  "touchB8E8": 972,
  "touchB1B2C1E1E3": 973,
  "touchB7B8C1E1E7": 974,
  "touchB1B2B3B7B8C1": 975,
  "touchB1B2B6B7B8C1": 976,
  "touchE4E5E6": 977,
  "touchB1B2B7B8C1E2E3E7E8": 978,
  "hold1+touchC1": 979,
  "touchB6E7": 980,
  "touchB3E3": 981,
  "touchB4E5": 982,
  "touchB5E5": 983,
  "holdC1+touchB1+touchB2+touchB6+touchB7+touchE2+touchE7": 984,
  "touchB4E4": 985,
  "touchB6E6": 986,
  "touchB8E1": 987,
  "touchB1E2": 988,
  "touchB7E7": 989,
  "touchD4": 990,
  "touchA6+touchD5": 991,
  "touchD6": 992,
  "touchA1A5B1B5C1": 993,
  "touchA7A8B7B8C1E8": 994,
  "touchA3A4B3B4C1E4": 995,
  "touchA5A6B5B6C1E6": 996,
  "touchA1A2B1B2C1E2": 997,
  "touchC1E1+touchE8": 998,
  "touchA1A2D2": 999,
  "touchA3A4D4": 1000,
  "touchA5A6D6": 1001,
  "touchE1E7": 1002,
  "touchE1E3": 1003,
  "touchE6E8": 1004,
  "touchE2E4": 1005,
  "holdC1+touchB2+touchB3+touchB6+touchB7": 1006,
  "tap4+touchB7+touchB8": 1007,
  "tap5+touchE1": 1008,
  "tap4+touchB1+touchB2": 1009,
  "tap8+touchC1": 1010,
  "touchD5": 1011,
  "touchB7B8E8": 1012,
  "touchB1B2E2": 1013,
  "touchB3B4B5B6E4E6": 1014,
  "touchB5B6E5E7": 1015,
  "slide1+touchB8": 1016,
  "slide8+touchB7": 1017,
  "touchB1B2B7B8E2E8": 1018,
  "touchB2B5C1": 1019,
  "touchB4B6C1": 1020,
  "touchB1B2B3B4B5B6B7B8C1": 1021,
  "hold1+touchE5": 1022,
  "touchB3B4E3": 1023,
  "touchB5B6E7": 1024,
  "touchB4B6": 1025,
  "touchE3E4E6E7": 1026,
  "touchB1B8C1": 1027,
  "tap7+touchE3": 1028,
  "tap8+touchE4": 1029,
  "tap1+touchE5": 1030,
  "tap2+touchE7": 1031,
  "tap1+touchE6": 1032,
  "tap8+touchE5": 1033,
  "hold1+touchE7": 1034,
  "tap3+touchE7": 1035,
  "tap4+touchE8": 1036,
  "tap6+touchE3": 1037,
  "tap5+touchE2": 1038,
  "tap4+touchE1": 1039,
  "slide6+touchE3": 1040,
  "touchB3B4E3E5": 1041,
  "touchB5B6E6": 1042,
  "touchB3B4E4": 1043,
  "touchB1B8E2E8": 1044,
  "touchC1E3E7": 1045,
  "touchA4A5D5E5": 1046,
  "touchA1A8D1E1": 1047,
  "touchB2B3B6B7C1E3E7": 1048,
  "touchE6+touchE7": 1049,
  "touchA5A6D6E6": 1050,
  "touchA3A4D4E4": 1051,
  "touchA2B2D2D3": 1052,
  "touchA6B6D6D7": 1053,
  "touchB2B6C1E3E7": 1054,
  "touchA2A3A6A7B2B3B6B7C1D3D7E3E7": 1055,
  "touchA5B5E5": 1056,
  "touchA4B4E5": 1057,
  "touchA4A6B4B6E5E6": 1058,
  "touchB6E6E7": 1059,
  "touchB3E3E4": 1060,
  "touchB7E7E8": 1061,
  "touchA1A2B1B2D1D2D3E1E2E3": 1062,
  "touchA1A2A8B1B2B8D1D2E1E2": 1063,
  "touchA7A8B7B8D1D7D8E1E7E8": 1064,
  "touchA1A7A8B1B7B8D1D8E1E8": 1065,
  "tap1+touchB6+touchE7": 1066,
  "touchB4+touchE5": 1067,
  "tap2+touchA6": 1068,
  "touchA5+touchD6": 1069,
  "tap7+touchA3+touchD4": 1070,
  "tap7+touchA3": 1071,
  "touchA4+touchD4": 1072,
  "touchB3+touchB4": 1073,
  "touchB5+touchB6": 1074,
  "touchA5+touchD5": 1075,
  "tap2+touchA6+touchD6": 1076,
  "touchB7+touchB8": 1077,
  "tap6+touchB2+touchE3": 1078,
  "tap4+touchB6": 1079,
  "touchB7+touchE8": 1080,
  "tap5+touchB3": 1081,
  "touchB2+touchE2": 1082,
  "touchB5+touchE5": 1083,
  "touchA4+touchD5": 1084,
  "touchB1+touchB2": 1085,
  "tap4+touchB6+touchB7": 1086,
  "touchD8": 1087,
  "tap2+touchA8+touchD8": 1088,
  "touchA7+touchD7": 1089,
  "touchD2": 1090,
  "touchC1D1": 1091,
  "tap8+touchA3": 1092,
  "touchA6+touchD6": 1093,
  "touchD7": 1094,
  "touchA1+touchD1": 1095,
  "touchC1D3": 1096,
  "tap1+touchA6": 1097,
  "touchA3+touchD3": 1098,
  "touchA2+touchD2": 1099,
  "touchD1": 1100,
  "touchC1D7": 1101,
  "tap7+touchA2": 1102,
  "touchA3+touchD4": 1103,
  "touchA8+touchD1": 1104,
  "touchA1+touchC1D2": 1105,
  "tap4+touchB7+touchD7+touchE7": 1106,
  "tap3+touchB6+touchD6+touchE6": 1107,
  "tap2+touchB5+touchD5+touchE5": 1108,
  "tap1+touchB4+touchD4+touchE4": 1109,
  "tap8+touchB3+touchD3+touchE3": 1110,
  "tap7+touchB2+touchD2+touchE2": 1111,
  "tap7+touchB1+touchD1+touchE1": 1112,
  "touchB1B8E1": 1113,
  "holdC1+touchB2+touchB7": 1114,
  "touchE4E5": 1115,
  "touchE5E6": 1116,
  "touchA4B4": 1117,
  "touchA5+touchA6": 1118,
  "touchA1A2A4A5D2D5": 1119,
  "touchA3A6D3D4D6D7": 1120,
  "touchA4A5A7A8D5D8": 1121,
  "touchA1A8D1": 1122,
  "touchA4A5D4D6E4E5E6": 1123,
  "touchB1B2E1E3": 1124,
  "touchB7B8E1E7": 1125,
  "touchB2B3E2E4": 1126,
  "touchB6B7E6E8": 1127,
  "touchB2B3E4": 1128,
  "touchB6B7E6": 1129,
  "touchB1B4B5B8E1E5": 1130,
  "touchB3B4B7B8E4E8": 1131,
  "touchB1B2B5B6C1E2E6": 1132,
  "holdC1+touchB2+touchB3+touchB6+touchB7+touchE3+touchE7": 1133,
  "touchB1B2B7B8": 1134,
  "touchE3E4": 1135,
  "touchB5E8": 1136,
  "touchB4E2": 1137,
  "touchB1B4": 1138,
  "touchB5B8": 1139,
  "touchE4E8": 1140,
  "touchC1E6": 1141,
  "touchC1E5": 1142,
  "touchB3B7C1": 1143,
  "touchB2B6C1": 1144,
  "touchB1B5C1": 1145,
  "touchC1E1E5": 1146,
  "touchE2E6": 1147,
  "touchB1E8": 1148,
  "touchB4E6": 1149,
  "touchB8E2": 1150,
  "touchB5E4": 1151,
  "touchB2B7E2E8": 1152,
  "touchB6B7C1E8": 1153,
  "touchB2B3C1E2": 1154,
  "touchB1B2B5B6C1": 1155,
  "touchB3B4B7B8C1": 1156,
  "touchC1E2": 1157,
  "touchC1E8": 1158,
  "tap4+touchB1+touchC1": 1159,
  "tap5+touchB8+touchC1": 1160,
  "tap3+touchB1+touchB8": 1161,
  "touchA2A8": 1162,
  "holdC1+touchA3": 1163,
  "touchB1B2B8+touchC1": 1164,
  "touchB1B2B3B4B5B6B7B8E6E8": 1165,
  "touchD3D7": 1166,
  "holdC1+touchB4+touchB5": 1167,
  "touchB4B5B6": 1168,
  "holdC1+touchB6+touchE7": 1169,
  "touchA2A6B2B6C1": 1170,
  "tap8+touchD2+touchE2": 1171,
  "tap8+touchD3+touchE3": 1172,
  "tap8+touchD4+touchE4": 1173,
  "tap8+touchD5+touchE5": 1174,
  "tap8+touchD6+touchE6": 1175,
  "tap8+touchD7+touchE7": 1176,
  "tap8+touchD8+touchE8": 1177,
  "touchD2E2": 1178,
  "touchD8E8": 1179,
  "touchA2A7B2B7C1": 1180,
  "holdC1+touchE6": 1181,
  "tap7+touchB4": 1182,
  "touchA6+touchE6": 1183,
  "touchB4+touchE6": 1184,
  "slide4+touchA8": 1185,
  "slide7+touchA4": 1186,
  "slide3+touchA7": 1187,
  "slide5+touchA1": 1188,
  "slide2+touchA5": 1189,
  "slide7+touchA2": 1190,
  "tap2+touchA7": 1191,
  "touchA4A5": 1192,
  "touchB2B6E2E3E6E7": 1193,
  "touchB3B7E3E4E7E8": 1194,
  "touchB7B8C1": 1195,
  "touchB6B7E7": 1196,
  "touchB2B3E3": 1197,
  "touchB1B2C1E2": 1198,
  "touchB2B3": 1199,
  "holdC1+touchB4+touchB5+touchB6+touchB7": 1200,
  "holdC1+touchB2+touchB3+touchB4+touchB5": 1201,
  "holdC1+touchB1+touchB2+touchB3+touchB4": 1202,
  "holdC1+touchB5+touchB6+touchB7+touchB8": 1203,
  "touchC1E1": 1204,
  "touchE1E2E8": 1205,
  "touchE2E8+touchE3E7+touchE4E6": 1206,
  "touchE2E8+touchE3E7": 1207,
  "tap1+holdC1": 1208,
  "touchB4+touchC1": 1209,
  "holdC1+touchB5+touchB6": 1210,
  "touchD6E6": 1211,
  "touchD4E4": 1212,
  "touchA4+touchA5": 1213,
  "touchA6+touchA7": 1214,
  "slide1+touchA8": 1215,
  "touchE2+touchE3": 1216,
  "touchA6D7": 1217,
  "touchA3D3": 1218,
  "touchA7D7": 1219,
  "touchA2D3": 1220,
  "holdC1+touchB4+touchB5+touchE5": 1221,
  "touchA2B2": 1222,
  "holdC1+touchA5+touchB5": 1223,
  "touchA7B7": 1224,
  "touchA5B5C1": 1225,
  "holdC1+slide8": 1226,
  "holdC1+slide1": 1227,
  "touchB4B5E4E5E6": 1228,
  "tap8+holdC1": 1229,
  "touchA3A6B3B6C1": 1230,
  "hold3+touchE1": 1231,
  "hold2+touchE7": 1232,
  "slide1+touchE4": 1233,
  "touchA3A4E4": 1234,
  "touchA1A2E2": 1235,
  "touchA7A8E8": 1236,
  "touchA5A6E6": 1237,
  "hold4+touchE6": 1238,
  "touchA2A6+touchD3D7": 1239,
  "touchA3A7": 1240,
  "touchD4D8": 1241,
  "touchA4A5B4B5": 1242,
  "touchB7B8D8": 1243,
  "touchA1A2B1B2E2": 1244,
  "touchA3A7B3B7C1": 1245,
  "touchD4D7": 1246,
  "touchA4A6+touchD5D6": 1247,
  "touchA2A4A6A8B2B4B6B8C1": 1248,
  "touchB4B8": 1249,
  "slide3+touchB5": 1250,
  "slide6+touchB4": 1251,
  "tap5+holdC1": 1252,
  "touchB1B8E1E2E8": 1253,
  "hold1+touchB6+touchE6": 1254,
  "hold7+touchB4+touchE4": 1255,
  "hold2+touchB4+touchE5": 1256,
  "touchB3+touchE3": 1257,
  "touchB5+touchB6+touchE7": 1258,
  "touchB2+touchB3": 1259,
  "touchA6+touchD7": 1260,
  "tap8+touchA4": 1261,
  "touchD5E5": 1262,
  "hold7+touchB6+touchE6": 1263,
  "tap8+touchB6+touchE6": 1264,
  "touchA5D5D6": 1265,
  "tap3+tap8+touchC1": 1266,
  "touchE7E8": 1267,
  "holdC1+touchB2+touchB6": 1268,
  "touchB2B3E2": 1269,
  "touchB6B7E8": 1270,
  "touchB1E1": 1271,
  "touchE4E7": 1272,
  "touchB5C1": 1273,
  "touchB4C1": 1274,
  "holdC1+touchB1+touchB6": 1275,
  "touchB2B3B4E2": 1276,
  "touchB5B6B7E8": 1277,
  "touchB1B3B5B7C1": 1278,
  "touchB1B2E2E4": 1279,
  "touchB6B8C1E6E8": 1280,
  "touchB1B2B3B4": 1281,
  "touchB5B6B7B8": 1282,
  "touchB1B2B3B4B5B6": 1283,
  "touchB1B4B5B8C1E1E5": 1284,
  "touchE1+touchE2": 1285,
  "touchE2E3": 1286,
  "touchC1E7": 1287,
  "touchC1E3": 1288,
  "touchE3+touchE4": 1289,
  "touchE4+touchE5": 1290,
  "touchE1+touchE8": 1291,
  "touchE7+touchE8": 1292,
  "touchB5B6B7C1E6E8": 1293,
  "touchB1B4B5B8C1": 1294,
  "holdC1+touchB3+touchB6": 1295,
  "tap6+touchE5": 1296,
  "tap2+touchE6": 1297,
  "hold1+holdC1": 1298,
  "touchB5B7": 1299,
  "touchB2B4": 1300,
  "holdC1+touchB1+touchB4+touchB5+touchB8": 1301,
  "touchC1E4E8": 1302,
  "touchC1E2E6": 1303,
  "touchB6+touchE6": 1304,
  "touchB3+touchE4": 1305,
  "hold8+touchB8": 1306,
  "hold7+touchB7": 1307,
  "tap6+touchB6": 1308,
  "tap5+touchB5": 1309,
  "tap4+touchB4": 1310,
  "tap3+touchB3": 1311,
  "tap2+touchB2": 1312,
  "tap1+touchB1": 1313,
  "tap1+tap8+touchC1": 1314,
  "tap35+touchC1": 1315,
  "touchA1A2B2B3D2": 1316,
  "touchA2A3B1B3E2E3": 1317,
  "touchA7B5B6B8C1E8": 1318,
  "touchB1B2B4B8C1E2E8": 1319,
  "touchA1A2A3A5A6A7B1B7C1D2D3D6D7": 1320,
  "touchA1B2B3B7B8C1E1E2E4E7": 1321,
  "touchA1A3A5A7B1B3B5B7C1": 1322,
  "touchA4A8B4B8C1": 1323,
  "touchA4E4E5": 1324,
  "tap1+touchA6+touchE6+touchE7": 1325,
  "tap1+touchB5+touchB6+touchE6": 1326,
  "tap8+touchA3+touchE3+touchE4": 1327,
  "touchA1A2A3B2B3C1D1D2": 1328,
  "touchA5A8B5B6B7B8D6D8E7": 1329,
  "hold8+touchE4+touchE5": 1330,
  "tap5+touchB4": 1331,
  "tap4+touchB5": 1332,
  "hold5+touchB3": 1333,
  "hold5+touchB4": 1334,
  "hold5+touchB5": 1335,
  "touchA2A3A4A6A7A8B2B8C1D3D4D7D8": 1336,
  "touchA8B1B2B6B7C1E1E3E6E8": 1337,
  "touchB3B4C1": 1338,
  "touchB1B2C1": 1339,
  "touchB5B6C1": 1340,
  "tap2+holdC1": 1341,
  "touchB2B3B4B8C1E1E2E5": 1342,
  "touchB2B7C1E3E7": 1343,
  "touchB2B3B6B7": 1344,
  "tap16+hold1+hold6": 1345,
  "touchB1B8E8+touchB2B7": 1346,
  "touchB4B5E6": 1347,
  "touchB4B5E4E6+touchB6": 1348,
  "touchB3B7": 1349,
  "touchB1B5": 1350,
  "touchC1+touchE8": 1351,
  "touchE1+touchE2+touchE8": 1352,
  "touchB2+touchB4+touchB5+touchB6+touchC1+touchE4+touchE6": 1353,
  "touchB3+touchC1+touchE4+touchE5+touchE6": 1354,
  "touchC1+touchE3+touchE5+touchE7": 1355,
  "touchA3D3D4": 1356,
  "touchA6D6D7": 1357,
  "slide1+touchC1": 1358,
  "tap6+touchC1": 1359,
  "touchB3B4E5": 1360,
  "touchB2B5": 1361,
  "touchB4B7": 1362,
  "touchB3B4B5": 1363,
  "touchB5B6B7": 1364,
  "touchB2B3B4": 1365,
  "touchB7B8E7": 1366,
  "touchB1B2E3": 1367,
  "tap7+touchE7": 1368,
  "tap7+touchC1": 1369,
  "tap7+touchE1": 1370,
  "tap7+holdC1": 1371,
  "tap7+touchE5": 1372,
  "tap2+touchE1": 1373,
  "tap2+touchE5": 1374,
  "touchB3B4B7B8C1E8": 1375,
  "touchE3E4E5": 1376,
  "touchE5E6E7": 1377,
  "touchE1E2E3": 1378,
  "touchE1E7E8": 1379,
  "touchE3E4E7E8": 1380,
  "touchE2E3E6E7": 1381,
  "touchB2B3B6B7E3E7": 1382,
  "touchB2C1": 1383,
  "touchB6C1": 1384,
  "touchC1E4": 1385,
  "touchB7C1": 1386,
  "holdC1+touchB3+touchB4+touchB7+touchB8": 1387,
  "touchE5+touchE6": 1388,
  "touchB7B8E1": 1389,
  "touchB1B2E1": 1390,
  "touchB5B6E5": 1391,
  "touchE1E4": 1392,
  "touchE1E6": 1393,
  "holdC1+touchE4": 1394,
  "holdC1+touchB2+touchB3+touchB6+touchB7+touchE2+touchE3+touchE7+touchE8": 1395,
  "holdC1+touchE3+touchE7": 1396,
  "touchB2B3C1": 1397,
  "touchB6B7C1": 1398,
  "touchB6B7B8E7E8": 1399,
  "touchB1B5C1E2E6": 1400,
  "touchB3B4E3E4E5": 1401,
  "tap4+tap5+touchC1": 1402,
  "touchB1B4B5B6B7B8C1": 1403,
  "touchB4B8C1E1E5": 1404,
  "touchB1B2B3B6B7B8C1": 1405,
  "touchA2A5E3E5": 1406,
  "touchA4A7E5E7": 1407,
  "touchA3A8E1E3": 1408,
  "touchA1A6E1E7": 1409,
  "touchA8B8E1E8": 1410,
  "touchA8B8E1": 1411,
  "touchA1B1E1": 1412,
  "hold2+holdC1": 1413,
  "hold6+holdC1": 1414,
  "hold7+holdC1": 1415,
  "hold3+holdC1": 1416,
  "touchB1B2B8": 1417,
  "touchA1A2A8D1D2": 1418,
  "touchB1B7B8": 1419,
  "touchA1A7A8D1D8": 1420,
  "touchA2A3B2B3E3": 1421,
  "touchA6A7B6B7E7": 1422,
  "tap28+touchC1": 1423,
  "touchB6B7B8": 1424,
  "touchB1B2B3": 1425,
  "touchB4E3": 1426,
  "touchB5E7": 1427,
  "touchB1E3": 1428,
  "touchB8E7": 1429,
  "touchB1B2B6B7E2E7": 1430,
  "touchB1C1": 1431,
  "touchB8C1": 1432,
  "touchB3B6E3E7": 1433,
  "touchB2B7E3E7": 1434,
  "touchB8E1E8": 1435,
  "touchB1E1E2": 1436,
  "touchB7E1": 1437,
  "touchB2E1": 1438,
  "tap6+holdC1": 1439,
  "tap3+holdC1": 1440,
  "touchB1B4E1E5": 1441,
  "touchB5B8E1E5": 1442,
  "hold6+touchE1": 1443,
  "hold5+touchE1": 1444,
  "hold4+touchE1": 1445,
  "tap3+holdC1+touchB7": 1446,
  "tap6+holdC1+touchB2": 1447,
  "touchB2B6+touchB3B5": 1448,
  "touchB8+touchC1": 1449,
  "touchB1B2B3B8E2": 1450,
  "touchB1B6B7B8E8": 1451,
  "touchB1B2B3E2E3": 1452,
  "touchB4B6E4E5E6E7": 1453,
  "touchB2B3B6B7C1E3E4E6E7": 1454,
  "tap2+tap3+hold7": 1455,
  "touchB1B6": 1456,
  "touchA2A4": 1457,
  "touchA5A7": 1458,
  "touchA7A8D8": 1459,
  "tap3+touchC1": 1460,
  "touchD1+touchD2": 1461,
  "tap8+touchD4": 1462,
  "touchB3B8": 1463,
  "touchA5B5E6": 1464,
  "touchA4B4E4": 1465,
  "touchA6B6E6": 1466,
  "touchA3B3E4": 1467,
  "touchB3D4E4": 1468,
  "touchB3D3E3": 1469,
  "touchB5D6E6": 1470,
  "touchB6D6E6": 1471,
  "touchB6D7E7": 1472,
  "touchB8D8E8": 1473,
  "touchB4D4E4": 1474,
  "touchB1D2E2": 1475,
  "touchA6A7E7": 1476,
  "touchA2B2E3": 1477,
  "touchA7B7E7": 1478,
  "touchA6D6E6": 1479,
  "touchA8D1E1": 1480,
  "touchB4B5C1E4E6": 1481,
  "touchB3B8E4E8": 1482,
  "touchB1B6E2E6": 1483,
  "touchB2B7E2E3E7E8": 1484,
  "touchB3B6C1E3E7": 1485,
  "touchA2A3A4D3D4": 1486,
  "touchA5A6A7D6D7": 1487,
  "tap1+tap7+touchB3+touchB5+touchC1": 1488,
  "touchB3B4B7B8C1E4E8": 1489,
  "holdC1+touchB1+touchB8": 1490,
  "touchB1B2B3B4B5B8C1E2E4": 1491,
  "touchE2E7+touchE3E6": 1492,
  "tap1+touchE1E2": 1493,
  "tap6+touchE7": 1494,
  "touchC1+touchE4": 1495,
  "touchB1B2B3B4E2E4": 1496,
  "touchB5B6B7B8E6E8": 1497,
  "touchC1E4E6": 1498,
  "touchB3E2": 1499,
  "touchB7E6": 1500,
  "touchB6E8": 1501,
  "touchB2E4": 1502,
  "holdC1+touchB3+touchB4+touchB5+touchB6": 1503,
  "holdC1+touchB1+touchB2+touchB7+touchB8": 1504,
  "touchB5B6B7C1E6": 1505,
  "touchB2B3B4C1E4": 1506,
  "touchB2B3B4E3E4": 1507,
  "touchB5B6B7E6E7": 1508,
  "touchB1B8E2": 1509,
  "touchB1B8E8": 1510,
  "touchB4B5E4": 1511,
  "tap4+holdC1": 1512,
  "touchB2B6E3E7": 1513,
  "touchB1B7": 1514,
  "touchB2B8": 1515,
  "tap1+touchE1": 1516,
  "tap8+touchE1": 1517,
  "tap4+touchE5": 1518,
  "tap5+touchE5": 1519,
  "touchB3C1": 1520,
  "tap3+touchB7+touchC1": 1521,
  "tap2+touchB6+touchC1": 1522,
  "tap1+touchB5+touchC1": 1523,
  "tap3+touchE8": 1524,
  "tap6+touchE2": 1525,
  "tap1+tap2+hold6": 1526,
  "tap2+tap3+hold8": 1527,
  "tap1+tap2+hold7": 1528,
  "touchB6B7C1E6E8": 1529,
  "touchB2B3C1E2E4": 1530,
  "tap1+touchB2+touchE2": 1531,
  "touchB6+touchE7": 1532,
  "touchB3+touchB4+touchE3": 1533,
  "tap37+touchC1": 1534,
  "touchE2E3E4": 1535,
  "touchE6E7E8": 1536,
  "touchB4B5B6B7": 1537,
  "tap3+touchB6": 1538,
  "tap4+touchE6": 1539,
  "tap5+touchE4": 1540,
  "slide3+slide7+touchC1": 1541,
  "tap7+touchB5": 1542,
  "tap7+touchB8": 1543,
  "tap7+touchB5+touchC1": 1544,
  "tap2+touchB4": 1545,
  "tap5+touchB1+touchB2": 1546,
  "tap5+touchB1+touchE2": 1547,
  "tap3+touchE6": 1548,
  "tap3+touchE2": 1549,
  "tap6+touchE4": 1550,
  "tap6+touchE8": 1551,
  "tap5+touchC1": 1552,
  "touchB3B4E2": 1553,
  "touchB6E5E7": 1554,
  "touchB2B4E3": 1555,
  "touchB5B7E8": 1556,
  "touchB2E2E4": 1557,
  "touchB7E6E8": 1558,
  "touchB1B3E1": 1559,
  "touchB4B6E7": 1560,
  "touchB3B4E2E4": 1561,
  "touchB5B7E6E8": 1562,
  "touchB2B4E2E3": 1563,
  "touchB6B8E1E7": 1564,
  "touchB3B5E3E6": 1565,
  "touchB4B7E4E8": 1566,
  "touchB1B7E2E7": 1567,
  "touchB2B8E3E8": 1568,
  "touchB3B4B6B7": 1569,
  "touchB3B6E4E5E6": 1570,
  "holdC1+touchE1+touchE5": 1571,
  "touchE3E6": 1572,
  "touchC1+touchE7": 1573,
  "touchC1+touchE1": 1574,
  "touchB4B5E5+touchC1": 1575,
  "touchB2B3E3+touchC1": 1576,
  "tap7+tap8+hold3": 1577,
  "tap6+tap35": 1578,
  "touchB4+touchB5": 1579,
  "touchB3+touchE5": 1580,
  "tap8+touchB8": 1581,
  "tap1+touchB3B7C1E4E7": 1582,
  "touchC1+touchE3": 1583,
  "touchB3+touchE7": 1584,
  "tap2+touchB3": 1585,
  "tap7+touchB6": 1586,
  "tap1+touchB3B7E4E7": 1587,
  "tap7+touchB7": 1588,
  "tap8+touchB2B6E3E4E5E6": 1589,
  "touchB2E5": 1590,
  "touchB7E5": 1591,
  "touchB6E1": 1592,
  "touchB2B3B4B5B6B7": 1593,
  "hold3+touchB2": 1594,
  "touchB1B6B7B8C1": 1595,
  "touchB1B2E1E2E3": 1596,
  "touchB1B2B3B8C1": 1597,
  "touchB3E5": 1598,
  "touchB6E5": 1599,
  "touchB7B8C1E8": 1600,
  "tap3+touchE3": 1601,
  "tap6+touchB3": 1602,
  "touchB4E4E5": 1603,
  "tap8+touchE2": 1604,
  "touchB3B4C1E4": 1605,
  "slide8+touchB2B3": 1606,
  "tap36+touchB4": 1607,
  "slide2+touchE7": 1608,
  "tap17+tap27+touchB1B7": 1609,
  "touchB3B5": 1610,
  "hold3+touchE2": 1611,
  "tap8+tap26": 1612,
  "tap45+touchE6": 1613,
  "touchB5+touchE6": 1614,
  "touchE4+touchE8": 1615,
  "tap5+slide2+touchB4": 1616,
  "tap2+tap8+hold2": 1617,
  "touchB3B4C1E3": 1618,
  "touchB5B6C1E7": 1619,
  "touchB2B7C1E2E8": 1620,
  "touchB2B3B4B5B6B7C1E5": 1621,
  "tap1+touchB7+touchE8": 1622,
  "tap8+touchB2+touchE2": 1623,
  "tap2+touchB8+touchE8": 1624,
  "tap7+touchB1+touchE2": 1625,
  "touchB1B2B3B8C1E2": 1626,
  "touchB1B6B7B8C1E8": 1627,
  "touchE4E6+touchE5": 1628,
  "tap78+touchE8": 1629,
  "tap12+touchE2": 1630,
  "touchB7C1E7E8": 1631,
  "touchB2C1E2E3": 1632,
  "touchB6B7B8C1E8": 1633,
  "touchB1B2B3C1E2": 1634,
  "touchB1B2C1E1E2E3": 1635,
  "slide3+touchE7": 1636,
  "touchB7B8C1E1E7E8": 1637,
  "touchB6+touchB7+touchE8": 1638,
  "tap1+tap2+touchC1": 1639,
  "touchB3B4B7B8": 1640,
  "touchB1B2B5B6": 1641,
  "touchB1B2B8C1": 1642,
  "hold1+touchE8": 1643,
  "hold2+touchE1": 1644,
  "hold4+touchE3": 1645,
  "hold5+touchE4": 1646,
  "hold6+touchE5": 1647,
  "hold7+touchE6": 1648,
  "hold8+touchE7": 1649,
  "touchB4E7": 1650,
  "touchB5E3": 1651,
  "touchB4+touchE4": 1652,
  "touchB3B7E4E8": 1653,
  "tap4+touchC1": 1654,
  "slide4+touchB7": 1655,
  "touchB7+touchE7": 1656,
  "touchB2+touchE3": 1657,
  "hold1+touchB5": 1658,
  "hold2+touchB6": 1659,
  "hold3+touchB7": 1660,
  "hold4+touchB8": 1661,
  "touchB6+touchB7": 1662,
  "tap2+tap7+touchC1": 1663,
  "touchB1B7B8E1E8": 1664,
  "touchB1B2B8E1E2": 1665,
  "touchB4B8C1E4E8": 1666,
  "holdC1+touchB3+touchB7": 1667,
  "hold8+holdC1": 1668,
  "hold8+holdC1+touchB2+touchB3": 1669,
  "hold1+holdC1+touchB6+touchB7": 1670,
  "hold1+touchE1": 1671,
  "hold2+touchE2": 1672,
  "tap2+touchE2": 1673,
  "tap4+touchE4": 1674,
  "touchC1+touchE6": 1675,
  "touchB2B3E2E3E4": 1676,
  "touchB1B6B7B8C1E1": 1677,
  "touchB1B3B5B7": 1678,
  "touchB2B4B6B8": 1679,
  "touchB1B7E1E8": 1680,
  "touchB2B8E1E2": 1681,
  "touchB6+touchB7+touchE7": 1682,
  "touchB2+touchB3+touchE2+touchE3": 1683,
  "holdC1+slide4": 1684,
  "tap18+touchB1": 1685,
  "touchB2+touchB3+touchB7+touchB8+touchC1": 1686,
  "touchB4+touchB5+touchB6+touchE4+touchE6": 1687,
  "slide7+touchB5": 1688,
  "touchB4B7C1": 1689,
  "touchB4E1": 1690,
  "touchB5E1": 1691,
  "tap1+tap78+slide2": 1692,
  "tap56+slide6": 1693,
  "tap27+touchE1": 1694,
  "tap8+slide1+touchC1": 1695,
  "tap5+tap7+slide2": 1696,
  "tap45+hold1": 1697,
  "touchB1B7C1": 1698,
  "slide4+touchB4E4": 1699,
  "touchB2E2+touchB5E6": 1700,
  "touchB2B8C1": 1701,
  "slide8+touchB3B7": 1702,
  "touchB1B6C1": 1703,
  "touchB3B8C1": 1704,
  "holdC1+touchB1+touchB2+touchB5+touchB6": 1705,
  "touchB1B2E2E3": 1706,
  "touchB7B8E7E8": 1707,
  "touchB4B6E4E7": 1708,
  "touchB2B5B8C1": 1709,
  "touchB1B4B7C1": 1710,
  "holdC1+touchB3": 1711,
  "holdC1+touchB6": 1712,
  "holdC1+touchB1+touchB4+touchB5+touchB8+touchE1+touchE5": 1713,
  "slide2+touchB6+touchE7": 1714,
  "slide5+touchB6+touchE7": 1715,
  "tap1+touchB8+touchE1": 1716,
  "tap8+touchB7+touchE8": 1717,
  "tap8+touchB1+touchE1": 1718,
  "touchB3B6+touchE3E7": 1719,
  "hold7+touchE1": 1720,
  "touchB4C1E5": 1721,
  "touchB5C1E5": 1722,
  "slide2+touchC1": 1723,
  "slide7+touchC1": 1724,
  "slide3+touchC1": 1725,
  "touchB3B7C1E3E4E7E8": 1726,
  "touchE1E5E6E7E8": 1727,
  "touchB1B4B5B6B7B8": 1728,
  "tap3+tap7+touchC1": 1729,
  "touchE5E8": 1730,
  "touchE2E5": 1731,
  "touchB5E5E6": 1732,
  "touchB5+touchC1": 1733,
  "touchB3B4E3E4": 1734,
  "touchB5B6E6E7": 1735,
  "touchB1+touchE2": 1736,
  "touchB8+touchE8": 1737,
  "touchB4B5C1E5": 1738,
  "touchB2B3C1E3": 1739,
  "touchB6B7C1E7": 1740,
  "touchB1B2B7B8C1E1": 1741,
  "tap17+touchC1": 1742,
  "tap1+tap2+hold4": 1743,
  "slide2+touchB4+touchB5+touchE5": 1744,
  "tap15+touchC1": 1745,
  "tap36+tap47": 1746,
  "tap7+tap8+touchB1+touchB2": 1747,
  "tap1+tap2+touchB7+touchB8": 1748,
  "tap8+touchB1": 1749,
  "tap7+touchB2": 1750,
  "tap1+touchB8": 1751,
  "tap2+touchB7": 1752,
  "hold6+touchB3+touchB4": 1753,
  "hold3+touchB5+touchB6": 1754,
  "tap8+touchE2+touchE3": 1755,
  "tap1+touchE7+touchE8": 1756,
  "hold3+touchB8": 1757,
  "hold6+touchB1": 1758,
  "hold4+touchB5+touchB6": 1759,
  "tap8+touchB7": 1760,
  "tap8+touchB3": 1761,
  "tap8+touchB5": 1762,
  "tap1+touchB2": 1763,
  "tap1+touchB6": 1764,
  "tap1+touchB4": 1765,
  "tap3+tap4+touchB5+touchB6": 1766,
  "tap58+touchE1": 1767,
  "touchB7E4": 1768,
  "touchB6B8": 1769,
  "touchC1+touchE5": 1770,
  "touchE1+touchE2E8": 1771,
  "tap5+slide4+touchC1E3E7+touchE4E5E6": 1772,
  "tap4+slide5+touchC1E3E7+touchE4E5E6": 1773,
  "touchB1B5C1E1E5": 1774,
  "tap8+tap57": 1775,
  "touchB2+touchC1": 1776,
  "touchB7+touchC1": 1777,
  "tap6+tap6+touchE4+touchE5": 1778,
  "tap2+touchB3+touchE4": 1779,
  "tap7+touchB6+touchE6": 1780,
  "tap7+touchB3+touchE4": 1781,
  "slide8+touchE4": 1782,
  "tap6+tap7+touchE3": 1783,
  "tap3+tap4+touchE1": 1784,
  "tap18+touchC1": 1785,
  "touchB1B4B5B8": 1786,
  "tap3+touchB7+touchE8": 1787,
  "tap6+touchB2+touchB3": 1788,
  "tap4+touchB6+touchE6": 1789,
  "hold3+touchE5": 1790,
  "tap6+touchB3+touchB4": 1791,
  "tap2+touchB5+touchB6": 1792,
  "hold8+touchC1": 1793,
  "slide1+touchB6+touchB7": 1794,
  "slide1+touchB3+touchB4": 1795,
  "tap1+touchB6+touchB7": 1796,
  "slide8+touchB2+touchB3": 1797,
  "slide8+touchB5+touchB6": 1798,
  "tap8+touchB2+touchB3": 1799,
  "touchC1E6E7": 1800,
  "touchC1E7E8": 1801,
  "holdC1+touchB6+touchB7": 1802,
  "holdC1+touchB2+touchB3": 1803,
  "slide4+touchB2+touchB3": 1804,
  "slide4+touchB5+touchB6": 1805,
  "tap4+touchB2+touchB3": 1806,
  "touchB1B3": 1807,
  "tap8+tap27+hold1": 1808,
  "touchB6B7B8E6": 1809,
  "touchB1B2B3E4": 1810,
  "touchC1E1E2E8": 1811,
  "touchC1E4E5E6": 1812,
  "holdC1+touchB1+touchB4+touchB5+touchB8+touchE4+touchE8": 1813,
  "tap2+hold1+hold5": 1814,
  "touchB2B7C1E2": 1815,
  "touchB3B7E3E7": 1816,
  "touchB2B5E2E6": 1817,
  "touchB5B6B7C1": 1818,
  "touchB2B3B4C1": 1819,
  "holdC1+touchB1+touchB5": 1820,
  "holdC1+touchB4+touchB8": 1821,
  "touchB2+touchB8": 1822,
  "touchB1B2B3B4E3": 1823,
  "touchB5B6B7B8E7": 1824,
  "touchB3B4B7E7": 1825,
  "touchB2B5B6E3": 1826,
  "hold4+touchB6+touchE6": 1827,
  "hold4+touchB6+touchB7": 1828,
  "hold4+touchB7+touchE8": 1829,
  "touchB3B5B6E3": 1830,
  "holdC1+touchB2+touchB7+touchE7": 1831,
  "holdC1+touchE3": 1832,
  "holdC1+touchB2+touchB3+touchE7": 1833,
  "holdC1+touchB6+touchB7+touchE3": 1834,
  "tap56+touchC1": 1835,
  "tap1+touchE8": 1836,
  "tap45+touchE5": 1837,
  "holdC1+touchB1+touchB7+touchB8": 1838,
  "touchB1B7B8C1": 1839,
  "touchB2B3B7B8": 1840,
  "touchB2B3B4B5B6B7C1E2E8": 1841,
  "touchB4B5B6E4": 1842,
  "touchB3B4B5E6": 1843,
  "touchB3B6E4E6": 1844,
  "touchE1E3+touchE4E5": 1845,
  "slide6+touchC1": 1846,
  "touchB2B4B6B8C1": 1847,
  "hold8+holdC1+touchB4": 1848,
  "tap1+touchB5+touchB6": 1849,
  "tap1+touchB3+touchB4": 1850,
  "hold1+holdC1+touchB5+touchB6": 1851,
  "tap1+touchB3+touchE3": 1852,
  "slide1+touchB7+touchB8+touchE8": 1853,
  "slide5+touchC1": 1854,
  "tap8+slide3+slide7": 1855,
  "tap48+touchC1": 1856,
  "tap1+tap2+holdC1": 1857,
  "tap5+slide1+touchC1": 1858,
  "touchB3B4B5B6E5": 1859,
  "tap8+touchE8": 1860,
  "tap18+touchB8": 1861,
  "tap28+touchB2": 1862,
  "tap17+touchB7": 1863,
  "tap26+touchB2": 1864,
  "tap37+touchB7": 1865,
  "tap46+touchB4": 1866,
  "tap25+touchB5": 1867,
  "tap47+touchB4": 1868,
  "tap16+touchB6": 1869,
  "tap38+touchB3B8": 1870,
  "tap16+touchB1B6": 1871,
  "tap15+touchB1B5": 1872,
  "tap37+touchB3B7": 1873,
  "tap48+touchB4B8": 1874,
  "tap26+touchB2B6": 1875,
  "tap14+touchB1B4": 1876,
  "tap58+touchB5B8": 1877,
  "tap6+touchE6": 1878,
  "tap2+touchB1+touchE2": 1879,
  "tap7+touchB8+touchE8": 1880,
  "tap3+touchB2+touchE3": 1881,
  "tap3+tap28": 1882,
  "tap1+slide8+touchC1": 1883,
  "tap2+tap3+slide8": 1884,
  "tap1+tap3+slide2": 1885,
  "tap8+touchE6": 1886,
  "tap4+touchE7": 1887,
  "tap1+touchE4": 1888,
  "tap7+touchE6": 1889,
  "tap2+touchE4": 1890,
  "tap7+slide6+touchE5": 1891,
  "slide4+touchC1": 1892,
  "hold5+holdC1": 1893,
  "tap15+tap68": 1894,
  "slide8+touchC1": 1895,
  "touchB2B3B6B7E2E8": 1896,
  "tap3+tap26": 1897,
  "tap15+tap15": 1898,
  "holdC1+touchB3+touchB6+touchE3+touchE7": 1899,
  "tap47+hold5+hold6": 1900,
  "touchC1E3E4E7E8": 1901,
  "touchC1E2E3E6E7": 1902,
  "touchC1E1E4E5E8": 1903,
  "touchC1E1E2E5E6": 1904,
  "touchC1E3E4E6E7": 1905,
  "touchC1E1E3E4E8": 1906,
  "touchC1E1E2E6E7": 1907,
  "touchC1E1E2E3E4": 1908,
  "touchC1E4E5E6E7": 1909,
  "touchC1E1E6E7E8": 1910,
  "touchC1E3E4E5E6": 1911,
  "touchB1B8+touchB2": 1912,
  "touchB6B7+touchB8": 1913,
  "touchE6E7+touchE8": 1914,
  "tap1+touchB7": 1915,
  "tap8+touchB3+touchE4": 1916,
  "slide1+touchE7": 1917,
  "tap7+touchB4+touchE4": 1918,
  "tap2+touchB5+touchE6": 1919,
  "tap8+tap17": 1920,
  "tap12+hold1+hold2": 1921,
  "slide1+slide2+slide3": 1922,
  "slide6+slide7+slide8": 1923,
  "slide2+slide3+slide4": 1924,
  "touchC1E5+touchE4": 1925,
  "touchB1B2B6B7C1": 1926,
  "touchB2B3B7B8C1": 1927,
  "tap8+touchB8+touchC1": 1928,
  "tap5+touchE7+touchE8": 1929,
  "touchB5E2": 1930,
  "touchB4E8": 1931,
  "touchB2B7+touchB3B6+touchC1+touchE1": 1932,
  "slide4+slide5+touchE5": 1933,
  "touchB2B7+touchB3B6+touchC1E3E7": 1934,
  "touchB1B8+touchE1": 1935,
  "tap27+tap36+tap45": 1936,
  "tap4+tap5+slide1": 1937,
  "touchB4+touchB8": 1938,
  "touchB1B2B7B8C1E3E7": 1939,
  "tap15+tap26+slide4+slide8": 1940,
  "slide4+slide8+touchB1B2B3B4B5B6B7B8C1": 1941,
  "holdC1+touchE8": 1942,
  "touchB2B6C1E2E3E6E7": 1943,
  "touchB3B7C1E4E8": 1944,
  "touchB2B6C1E2E6": 1945,
  "tap4+touchB7+touchE8": 1946,
  "tap6+touchB3+touchE4": 1947,
  "touchB1B5E1E5": 1948,
  "touchB3B7C1E3E7": 1949,
  "tap5+touchB2+touchE3": 1950,
  "tap3+touchB6+touchE7": 1951,
  "tap7+touchB3+touchE3": 1952,
  "tap1+touchB8+touchE8": 1953,
  "tap8+touchB5+touchE5": 1954,
  "tap1+touchB4+touchE5": 1955,
  "tap5+touchB1+touchE1": 1956,
  "tap4+touchB8+touchE1": 1957,
  "tap5+tap6+hold1": 1958,
  "tap3+tap4+hold8": 1959,
  "tap24+touchC1": 1960,
  "touchB3+touchB4+touchB5": 1961,
  "touchB3B4C1E3E5": 1962,
  "touchB2B7C1E3E4E5E6E7": 1963,
  "touchB3B4B5B6C1E3E7": 1964,
  "hold7+touchC1": 1965,
  "touchB3B6+touchB4B5E4E6": 1966,
  "touchB2B7+touchE2E8": 1967,
  "tap6+hold1+touchE6": 1968,
  "tap6+hold2+touchE6": 1969,
  "tap3+hold8+touchE4": 1970,
  "tap6+touchB5+touchE6": 1971,
  "tap3+touchB4+touchE4": 1972,
  "tap8+slide2+slide6": 1973,
  "tap17+tap26": 1974,
  "touchA7B1B8E2E8": 1975,
